sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
/***************************************************************************//**
* \file ADC_Sensing.h
* \version 7.0
*
* \brief
*   This file provides the headers of APIs specific to implementation of the
*   sensing FW block.
*
* \see ADC v7.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2019), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_SENSE_ADC_SENSING_H)
#define CY_SENSE_ADC_SENSING_H

#include <CyLib.h>
#include <cyfitter.h>
#include "cytypes.h"
#include <cypins.h>
#include "ADC_Configuration.h"
#include "ADC_Structure.h"
#include "ADC_ISR.h"

/*******************************************************************************
* Enumeration types definition
*******************************************************************************/

/* Pin states */
#define ADC_GROUND                                 (0u)
#define ADC_HIGHZ                                  (1u)
#define ADC_SHIELD                                 (2u)
#define ADC_SENSOR                                 (3u)
#define ADC_TX_PIN                                 (4u)
#define ADC_RX_PIN                                 (5u)

/***************************************************************************//**
* \brief Defines operation modes types
*******************************************************************************/
typedef enum
{
    ADC_SCAN_CSD_E     = 0x00u,
    ADC_SCAN_CSX_E     = 0x01u,
    ADC_BIST_CSD_SNS_CAP_E = 0x02u,
    ADC_BIST_CSX_SNS_CAP_E = 0x03u,
    ADC_BIST_CSD_SH_CAP_E  = 0x04u,
} ADC_OPERATION_MODE_ENUM;


#if (ADC_ENABLE != ADC_ADC_STANDALONE_EN)
/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/**
* \cond (SECTION_C_HIGH_LEVEL || SECTION_I_HIGH_LEVEL)
* \addtogroup group_c_high_level
* \{
*/

cystatus ADC_SetupWidget(uint32 widgetId);
cystatus ADC_Scan(void);
cystatus ADC_ScanAllWidgets(void);
uint32 ADC_IsBusy(void);

/** \}
* \endcond */

/**
* \cond (SECTION_C_LOW_LEVEL || SECTION_I_LOW_LEVEL)
* \addtogroup group_c_low_level
* \{
*/

void ADC_SetPinState(uint32 widgetId, uint32 sensorElement, uint32 state);

cystatus ADC_SetupWidgetExt(uint32 widgetId, uint32 sensorId);
cystatus ADC_ScanExt(void);

#if (ADC_ANYMODE_AUTOCAL)
    cystatus ADC_CalibrateWidget(uint32 widgetId);
    cystatus ADC_CalibrateAllWidgets(void);
#endif /* (ADC_ANYMODE_AUTOCAL) */

#if((ADC_ENABLE == ADC_CSD_EN) ||\
    (ADC_ENABLE == ADC_CSX_EN))
    uint32_t ADC_SetInactiveElectrodeState(ADC_OPERATION_MODE_ENUM mode, uint32_t state);
#endif /* ((ADC_ENABLE == ADC_CSD_EN) ||\
           (ADC_ENABLE == ADC_CSX_EN)) */

/** \}
* \endcond */

/**
* \cond SECTION_C_INTERNAL
* \addtogroup group_c_internal
* \{
*/

cystatus ADC_SsInitialize(void);
void ADC_SsSetModClkClockDivider(uint32 modClk);
void ADC_SsSetSnsClockDivider(uint32 snsClk);
void ADC_SsSetClockDividers(uint32 snsClk, uint32 modClk);
void ADC_SsIsrInitialize(cyisraddress address);
void ADC_SsPostAllWidgetsScan(void);
void ADC_SsSetAllIOsState(uint32 state);
void ADC_SsSwitchSensingMode(ADC_SENSE_METHOD_ENUM mode);

#if (ADC_CSD_SS_DIS != ADC_CSD_AUTOTUNE)
    cystatus ADC_SsAutoTune(void);
#endif

#if (ADC_ENABLE == ADC_MULTI_FREQ_SCAN_EN)
    void ADC_SsChangeImoFreq(uint32 value);
    void ADC_SsChangeClkFreq(uint32 chId);
#endif

#if (ADC_ENABLE == ADC_ADC_EN)
    cystatus ADC_SsReleaseResources(void);
#endif

#if((ADC_ENABLE == ADC_CSD_EN) || \
    (((ADC_ENABLE == ADC_CSX_EN) || \
    (ADC_ENABLE == ADC_ISX_EN)) && \
    (ADC_ENABLE == ADC_CSDV2)))
    void ADC_SsInitializeSourceSenseClk(void);
#endif

#if (ADC_ENABLE == ADC_CSD_EN)
    uint32 ADC_SsCSDGetColSnsClkDivider(uint32 widgetId);

    #if ((ADC_ENABLE == ADC_CSD_MATRIX_WIDGET_EN) || \
         (ADC_ENABLE == ADC_CSD_TOUCHPAD_WIDGET_EN))
        uint32 ADC_SsCSDGetRowSnsClkDivider(uint32 widgetId);
    #endif

    #if (ADC_CLK_SOURCE_PRSAUTO == ADC_CSD_SNS_CLK_SOURCE)
        uint8 ADC_SsCSDCalcPrsSize(uint32 snsClkDivider, uint32 resolution);
    #endif
#endif

void ADC_DischargeExtCapacitors(uint32 dischargeTime);
void ADC_WriteBitsSafe(reg32 * regPtr, uint32 mask, uint32 value);

/** \}
* \endcond */

