sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
/***************************************
* Global software/external variables
***************************************/
extern volatile uint8 ADC_widgetIndex;
extern volatile uint8 ADC_sensorIndex;
extern uint8 ADC_requestScanAllWidget;

extern ADC_RAM_SNS_STRUCT *ADC_curRamSnsPtr;
extern ADC_SENSE_METHOD_ENUM ADC_currentSenseMethod;

#if(ADC_ENABLE == ADC_MULTI_FREQ_SCAN_EN)
    extern uint8 ADC_scanFreqIndex;
    extern uint8 ADC_immunity[ADC_NUM_SCAN_FREQS];
#else
    extern const uint8 ADC_scanFreqIndex;
#endif

#if ((ADC_ENABLE == ADC_CSD_GANGED_SNS_EN) || \
     (ADC_ENABLE == ADC_CSX_EN) || \
     (ADC_ENABLE == ADC_ISX_EN))
    extern ADC_FLASH_WD_STRUCT const *ADC_curFlashWdgtPtr;
#endif

#if (ADC_ENABLE == ADC_CSD_GANGED_SNS_EN)
    /* Pointer to Flash structure holding info of sensor to be scanned */
    extern ADC_FLASH_SNS_STRUCT const *ADC_curFlashSnsPtr;
#endif

extern ADC_FLASH_IO_STRUCT const *ADC_curSnsIOPtr;

/***************************************************************************//**
* \brief Declares the IDAC gain table structure
*******************************************************************************/
typedef struct
{
    /**
     *  Register value of IDAC gain
     */
    uint32 gainReg;

    /**
     *  Absolute gain value in pA
     */
    uint32 gainValue;
} ADC_IDAC_GAIN_TABLE_STRUCT;

#if (ADC_ENABLE == ADC_CSDV1)
    #define ADC_IDAC_GAIN_MASK                         (0x00000400uL)
    #define ADC_IDAC_GAIN_NUMBER                       (2u)
    #define ADC_IDAC_GAIN_TABLE_INIT                   {{0x00000000u, 1200000u},\
                                                                     {0x00000400u, 2400000u}}
#elif (ADC_ENABLE == ADC_CSDV2_VER1)
    #define ADC_IDAC_GAIN_MASK                         (0x03C00000uL)
    #define ADC_IDAC_GAIN_NUMBER                       (6u)
    #define ADC_IDAC_GAIN_TABLE_INIT                   {{0x01000000u,   37500u},\
                                                                     {0x03000000u,   75000u},\
                                                                     {0x01400000u,  300000u},\
                                                                     {0x03400000u,  600000u},\
                                                                     {0x01800000u, 2400000u},\
                                                                     {0x03800000u, 4800000u}}
#elif (ADC_ENABLE == ADC_CSDV2_VER2)
    #define ADC_IDAC_GAIN_MASK                         (0x03C00000uL)
    #define ADC_IDAC_GAIN_NUMBER                       (7u)
    #define ADC_IDAC_GAIN_TABLE_INIT                   {{0x01000000u,   37500u},\
                                                                     {0x03000000u,   75000u},\
                                                                     {0x01400000u,  300000u},\
                                                                     {0x03400000u,  600000u},\
                                                                     {0x01C00000u, 1200000u},\
                                                                     {0x01800000u, 2400000u},\
                                                                     {0x03800000u, 4800000u}}
#endif
extern ADC_IDAC_GAIN_TABLE_STRUCT const ADC_idacGainTable[ADC_IDAC_GAIN_NUMBER];

#endif /* (ADC_ENABLE != ADC_ADC_STANDALONE_EN) */

/****************************************************************************
* m0s8csd, m0s8peri, hsiom, and IO hardware-related registers address
****************************************************************************/
#if (ADC_ENABLE == ADC_CSDV2)

    /* Fourth-generation HW block registers   */
    #define ADC_CONFIG_REG                         (*(reg32 *) CYREG_CSD_CONFIG)
    #define ADC_CONFIG_PTR                         ( (reg32 *) CYREG_CSD_CONFIG)
    #define ADC_STAT_SEQ_REG                       (*(reg32 *) CYREG_CSD_CONFIG)
    #define ADC_STAT_SEQ_PTR                       ( (reg32 *) CYREG_CSD_CONFIG)
    #define ADC_CSD_IDACA_REG                      (*(reg32 *) CYREG_CSD_IDACA)
    #define ADC_CSD_IDACA_PTR                      ( (reg32 *) CYREG_CSD_IDACA)
    #define ADC_CSD_IDACB_REG                      (*(reg32 *) CYREG_CSD_IDACB)
    #define ADC_CSD_IDACB_PTR                      ( (reg32 *) CYREG_CSD_IDACB)
    #define ADC_SENSE_PERIOD_REG                   (*(reg32 *) CYREG_CSD_SENSE_PERIOD)
    #define ADC_SENSE_PERIOD_PTR                   ( (reg32 *) CYREG_CSD_SENSE_PERIOD)
    #define ADC_RESULT_VAL1_REG                    (*(reg32 *) CYREG_CSD_RESULT_VAL1)
    #define ADC_RESULT_VAL1_PTR                    ( (reg32 *) CYREG_CSD_RESULT_VAL1)
    #define ADC_RESULT_VAL2_REG                    (*(reg32 *) CYREG_CSD_RESULT_VAL2)
    #define ADC_RESULT_VAL2_PTR                    ( (reg32 *) CYREG_CSD_RESULT_VAL2)
    #define ADC_INTR_REG                           (*(reg32 *) CYREG_CSD_INTR)
    #define ADC_INTR_PTR                           ( (reg32 *) CYREG_CSD_INTR)
    #define ADC_INTR_SET_REG                       (*(reg32 *) CYREG_CSD_INTR_SET)
    #define ADC_INTR_SET_PTR                       ( (reg32 *) CYREG_CSD_INTR_SET)
    #define ADC_INTR_MASK_REG                      (*(reg32 *) CYREG_CSD_INTR_MASK)
    #define ADC_INTR_MASK_PTR                      ( (reg32 *) CYREG_CSD_INTR_MASK)
    #define ADC_COUNTER_REG                        (ADC_RESULT_VAL1_REG)
    #define ADC_COUNTER_PTR                        (ADC_RESULT_VAL1_PTR)
    #define ADC_REFGEN_REG                         (*(reg32 *) CYREG_CSD_REFGEN)
    #define ADC_REFGEN_PTR                         ( (reg32 *) CYREG_CSD_REFGEN)
    #define ADC_SEQ_TIME_REG                       (*(reg32 *) CYREG_CSD_SEQ_TIME)
    #define ADC_SEQ_TIME_PTR                       ( (reg32 *) CYREG_CSD_SEQ_TIME)
    #define ADC_SEQ_INIT_CNT_REG                   (*(reg32 *) CYREG_CSD_SEQ_INIT_CNT)
    #define ADC_SEQ_INIT_CNT_PTR                   ( (reg32 *) CYREG_CSD_SEQ_INIT_CNT)
    #define ADC_SEQ_NORM_CNT_REG                   (*(reg32 *) CYREG_CSD_SEQ_NORM_CNT)
    #define ADC_SEQ_NORM_CNT_PTR                   ( (reg32 *) CYREG_CSD_SEQ_NORM_CNT)
    #define ADC_SEQ_START_REG                      (*(reg32 *) CYREG_CSD_SEQ_START)
    #define ADC_SEQ_START_PTR                      ( (reg32 *) CYREG_CSD_SEQ_START)
    #define ADC_CSDCMP_REG                         (*(reg32 *) CYREG_CSD_CSDCMP)
    #define ADC_CSDCMP_PTR                         ( (reg32 *) CYREG_CSD_CSDCMP)
    #define ADC_HSCMP_REG                          (*(reg32 *) CYREG_CSD_HSCMP)
    #define ADC_HSCMP_PTR                          ( (reg32 *) CYREG_CSD_HSCMP)
    #define ADC_SENSE_DUTY_REG                     (*(reg32 *) CYREG_CSD_SENSE_DUTY)
    #define ADC_SENSE_DUTY_PTR                     ( (reg32 *) CYREG_CSD_SENSE_DUTY)
    #define ADC_AMBUF_REG                          (*(reg32 *) CYREG_CSD_AMBUF)
    #define ADC_AMBUF_PTR                          ( (reg32 *) CYREG_CSD_AMBUF)
    #define ADC_SW_BYP_SEL_REG                     (*(reg32 *) CYREG_CSD_SW_BYP_SEL)
    #define ADC_SW_BYP_SEL_PTR                     ( (reg32 *) CYREG_CSD_SW_BYP_SEL)
    #define ADC_SW_CMP_P_SEL_REG                   (*(reg32 *) CYREG_CSD_SW_CMP_P_SEL)
    #define ADC_SW_CMP_P_SEL_PTR                   ( (reg32 *) CYREG_CSD_SW_CMP_P_SEL)
    #define ADC_SW_REFGEN_SEL_REG                  (*(reg32 *) CYREG_CSD_SW_REFGEN_SEL)
    #define ADC_SW_REFGEN_SEL_PTR                  ( (reg32 *) CYREG_CSD_SW_REFGEN_SEL)
    #define ADC_SW_CMP_N_SEL_REG                   (*(reg32 *) CYREG_CSD_SW_CMP_N_SEL)
    #define ADC_SW_CMP_N_SEL_PTR                   ( (reg32 *) CYREG_CSD_SW_CMP_N_SEL)
    #define ADC_SW_RES_REG                         (*(reg32 *) CYREG_CSD_SW_RES)
    #define ADC_SW_RES_PTR                         ( (reg32 *) CYREG_CSD_SW_RES)
    #define ADC_SW_HS_P_SEL_REG                    (*(reg32 *) CYREG_CSD_SW_HS_P_SEL)
    #define ADC_SW_HS_P_SEL_PTR                    ( (reg32 *) CYREG_CSD_SW_HS_P_SEL)
    #define ADC_SW_SHIELD_SEL_REG                  (*(reg32 *) CYREG_CSD_SW_SHIELD_SEL)
    #define ADC_SW_SHIELD_SEL_PTR                  ( (reg32 *) CYREG_CSD_SW_SHIELD_SEL)
    #define ADC_SW_AMUXBUF_SEL_REG                 (*(reg32 *) CYREG_CSD_SW_AMUXBUF_SEL)
    #define ADC_SW_AMUXBUF_SEL_PTR                 ( (reg32 *) CYREG_CSD_SW_AMUXBUF_SEL)
    #define ADC_SW_HS_N_SEL_REG                    (*(reg32 *) CYREG_CSD_SW_HS_N_SEL)
    #define ADC_SW_HS_N_SEL_PTR                    ( (reg32 *) CYREG_CSD_SW_HS_N_SEL)
    #define ADC_SW_FW_MOD_SEL_REG                  (*(reg32 *) CYREG_CSD_SW_FW_MOD_SEL)
    #define ADC_SW_FW_MOD_SEL_PTR                  ( (reg32 *) CYREG_CSD_SW_FW_MOD_SEL)
    #define ADC_SW_FW_TANK_SEL_REG                 (*(reg32 *) CYREG_CSD_SW_FW_TANK_SEL)
    #define ADC_SW_FW_TANK_SEL_PTR                 ( (reg32 *) CYREG_CSD_SW_FW_TANK_SEL)
    #define ADC_SW_DSI_SEL_REG                     (*(reg32 *) CYREG_CSD_SW_DSI_SEL)
    #define ADC_SW_DSI_SEL_PTR                     ( (reg32 *) CYREG_CSD_SW_DSI_SEL)
    #define ADC_ADC_CTL_REG                        (*(reg32 *) CYREG_CSD_ADC_CTL)
    #define ADC_ADC_CTL_PTR                        ( (reg32 *) CYREG_CSD_ADC_CTL)
    #define ADC_ADC_RES_REG                        (*(reg32 *) CYREG_CSD_ADC_RES)
    #define ADC_ADC_RES_PTR                        ( (reg32 *) CYREG_CSD_ADC_RES)

#else

