sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
    /* CSD block registers   */
    #define ADC_CONFIG_REG                         (*(reg32 *) ADC_CSD__CSD_CONFIG)
    #define ADC_CONFIG_PTR                         ( (reg32 *) ADC_CSD__CSD_CONFIG)
    #define ADC_IDAC_CONTR_REG                     (*(reg32 *) ADC_IDACMod_cy_psoc4_idac__CONTROL)
    #define ADC_IDAC_CONTR_PTR                     ( (reg32 *) ADC_IDACMod_cy_psoc4_idac__CONTROL)
    #define ADC_IDAC_REG                           (*(reg32 *) ADC_IDACMod_cy_psoc4_idac__CSD_IDAC)
    #define ADC_IDAC_PTR                           ( (reg32 *) ADC_IDACMod_cy_psoc4_idac__CSD_IDAC)
    #define ADC_COUNTER_REG                        (*(reg32 *) ADC_CSD__CSD_COUNTER)
    #define ADC_COUNTER_PTR                        ( (reg32 *) ADC_CSD__CSD_COUNTER)
    #define ADC_STATUS_REG                         (*(reg32 *) ADC_CSD__CSD_STATUS)
    #define ADC_STATUS_PTR                         ( (reg32 *) ADC_CSD__CSD_STATUS)
    #define ADC_INTR_REG                           (*(reg32 *) ADC_CSD__CSD_INTR)
    #define ADC_INTR_PTR                           ( (reg32 *) ADC_CSD__CSD_INTR)
    #define ADC_INTR_SET_REG                       (*(reg32 *) CYREG_CSD_INTR_SET)
    #define ADC_INTR_SET_PTR                       ( (reg32 *) CYREG_CSD_INTR_SET)
    #define ADC_PWM_REG                            (*(reg32 *) CYREG_CSD_PWM)
    #define ADC_PWM_PTR                            ( (reg32 *) CYREG_CSD_PWM)
    #define ADC_TRIM1_REG                          (*(reg32 *) ADC_IDACMod_cy_psoc4_idac__CSD_TRIM1)
    #define ADC_TRIM1_PTR                          ( (reg32 *) ADC_IDACMod_cy_psoc4_idac__CSD_TRIM1)
    #define ADC_TRIM2_REG                          (*(reg32 *) ADC_IDACMod_cy_psoc4_idac__CSD_TRIM2)
    #define ADC_TRIM2_PTR                          ( (reg32 *) ADC_IDACMod_cy_psoc4_idac__CSD_TRIM2)

    #if (CY_PSOC4_4100M || CY_PSOC4_4200M || CY_PSOC4_4200L)
        #if (1u != ADC_CSD__CSD_NUMBER)
            #define ADC_SFLASH_TRIM1_REG           (*(reg8 *) CYREG_SFLASH_CSD_TRIM1_CSD)
            #define ADC_SFLASH_TRIM1_PTR           ( (reg8 *) CYREG_SFLASH_CSD_TRIM1_CSD)

            #define ADC_SFLASH_TRIM2_REG           (*(reg8 *) CYREG_SFLASH_CSD_TRIM2_CSD)
            #define ADC_SFLASH_TRIM2_PTR           ( (reg8 *) CYREG_SFLASH_CSD_TRIM2_CSD)
        #else
            #define ADC_SFLASH_TRIM1_REG           (*(reg8 *) CYREG_SFLASH_CSD1_TRIM1_CSD)
            #define ADC_SFLASH_TRIM1_PTR           ( (reg8 *) CYREG_SFLASH_CSD1_TRIM1_CSD)

            #define ADC_SFLASH_TRIM2_REG           (*(reg8 *) CYREG_SFLASH_CSD1_TRIM2_CSD)
            #define ADC_SFLASH_TRIM2_PTR           ( (reg8 *) CYREG_SFLASH_CSD1_TRIM2_CSD)
        #endif /* (1u != ADC_CSD__CSD_NUMBER) */
    #else
        #define ADC_SFLASH_TRIM1_REG               (*(reg8 *) CYREG_SFLASH_CSD_TRIM1_CSD)
        #define ADC_SFLASH_TRIM1_PTR               ( (reg8 *) CYREG_SFLASH_CSD_TRIM1_CSD)

        #define ADC_SFLASH_TRIM2_REG               (*(reg8 *) CYREG_SFLASH_CSD_TRIM2_CSD)
        #define ADC_SFLASH_TRIM2_PTR               ( (reg8 *) CYREG_SFLASH_CSD_TRIM2_CSD)
    #endif /* (CY_PSOC4_4100M || CY_PSOC4_4200M || CY_PSOC4_4200L) */
#endif /* (ADC_ENABLE == ADC_CSDV2) */

/* Third-generation and Fourth-generation HW block PERI CLOCK registers */
#if defined(CYIPBLOCK_m0s8peri_VERSION)
    #define ADC_IS_M0S8PERI_BLOCK                  (1u)
    #define ADC_M0S8PERI_BLOCK_VER                 ((CYIPBLOCK_m0s8peri_VERSION))
#else
    #define ADC_IS_M0S8PERI_BLOCK                  (0u)
    #define ADC_M0S8PERI_BLOCK_VER                 (0u)
#endif /* (CYIPBLOCK_m0s8peri_VERSION) */

#if (ADC_ENABLE == ADC_IS_M0S8PERI_BLOCK)
    #define ADC_MODCLK_DIV_REG                     (*(reg32 *)ADC_ModClk__DIV_REGISTER)
    #define ADC_MODCLK_DIV_PTR                     ( (reg32 *)ADC_ModClk__DIV_REGISTER)
    #define ADC_MODCLK_CMD_REG                     (*(reg32 *)CYREG_PERI_DIV_CMD)
    #define ADC_MODCLK_CMD_PTR                     ( (reg32 *)CYREG_PERI_DIV_CMD)
    #if (ADC_DISABLE == ADC_CSDV2)
        #define ADC_SNSCLK_DIV_REG                 (*(reg32 *)ADC_SnsClk__DIV_REGISTER)
        #define ADC_SNSCLK_DIV_PTR                 ( (reg32 *)ADC_SnsClk__DIV_REGISTER)
        #define ADC_SNSCLK_CMD_REG                 (*(reg32 *)CYREG_PERI_DIV_CMD)
        #define ADC_SNSCLK_CMD_PTR                 ( (reg32 *)CYREG_PERI_DIV_CMD)
    #endif /* (ADC_DISABLE == ADC_CSDV2) */
#else
    #define ADC_MODCLK_DIV_REG                     (*(reg32 *)ADC_ModClk__REGISTER)
    #define ADC_MODCLK_DIV_PTR                     ( (reg32 *)ADC_ModClk__REGISTER)
    #define ADC_SNSCLK_DIV_REG                     (*(reg32 *)ADC_SnsClk__REGISTER)
    #define ADC_SNSCLK_DIV_PTR                     ( (reg32 *)ADC_SnsClk__REGISTER)
    #define ADC_MODCLK_CMD_REG                     (ADC_MODCLK_DIV_REG)
    #define ADC_MODCLK_CMD_PTR                     (ADC_MODCLK_DIV_PTR)
    #define ADC_SNSCLK_CMD_REG                     (ADC_SNSCLK_DIV_REG)
    #define ADC_SNSCLK_CMD_PTR                     (ADC_SNSCLK_DIV_PTR)
#endif /* (ADC_ENABLE == ADC_IS_M0S8PERI_BLOCK) */

/****************************************************************************
* m0s8csd, m0s8peri, hsiom, and IO hardware-related registers masks
****************************************************************************/
#if (ADC_ENABLE == ADC_CSDV2)

    #if ((ADC_ENABLE == ADC_CSD_SHIELD_EN) && \
         (ADC_ENABLE == ADC_CSD_SHIELD_TANK_EN))
        #define ADC_CTANK_CONNECTION           (ADC_CSD__DEDICATED_IO1)
    #else
        #define ADC_CTANK_CONNECTION               (0x00000000uL)
    #endif /* ((ADC_ENABLE == ADC_CSD_SHIELD_EN) && \
               (ADC_ENABLE == ADC_CSD_SHIELD_TANK_EN)) */

    #if(0u != ADC_CSX_EN)
        #define ADC_CMOD_CONNECTION                (ADC_CSD__CSHIELD_PAD)
    #else
        #define ADC_CMOD_CONNECTION                (ADC_CSD__DEDICATED_IO0)
    #endif /* (ADC_CSX_EN == 1u) */

    /* Fourth-generation HW block masks for the resistance or low EMI (slow ramp)  */
    #define ADC_RES_LOW                            (0u)
    #define ADC_RES_MED                            (1u)
    #define ADC_RES_HIGH                           (2u)
    #define ADC_RES_LOWEMI                         (3u)

    /* Fourth-generation HW block masks for the waveforms for corresponding switch  */
    #define ADC_STATIC_OPEN                        (0x00000000Lu)
    #define ADC_STATIC_CLOSE                       (0x00000001Lu)
    #define ADC_PHI1                               (0x00000002Lu)
    #define ADC_PHI2                               (0x00000003Lu)
    #define ADC_PHI1_HSCMP                         (0x00000004Lu)
    #define ADC_PHI2_HSCMP                         (0x00000005Lu)
    #define ADC_HSCMP                              (0x00000006Lu)

    #define ADC_SW_DSI_CMOD                        (1uL << 4u)
    #define ADC_SW_DSI_CTANK                       (1uL << 0u)

    /* Fourth-generation HW block CSD_CONFIG register masks    */
    #define ADC_CONFIG_FILTER_DELAY_MASK           (((0x00000001Lu << CYFLD_CSD_FILTER_DELAY__SIZE) - 1u) << CYFLD_CSD_FILTER_DELAY__OFFSET)
    #define ADC_CONFIG_FILTER_DELAY_2_CYCLES       (0x00000002Lu)
    #define ADC_CONFIG_FILTER_DELAY_3_CYCLES       (0x00000003Lu)
    #define ADC_CONFIG_FILTER_DELAY_4_CYCLES       (0x00000004Lu)
    #define ADC_CONFIG_FILTER_DELAY_12MHZ          (ADC_CONFIG_FILTER_DELAY_2_CYCLES << CYFLD_CSD_FILTER_DELAY__OFFSET)
    #define ADC_CONFIG_FILTER_DELAY_24MHZ          (ADC_CONFIG_FILTER_DELAY_3_CYCLES << CYFLD_CSD_FILTER_DELAY__OFFSET)
    #define ADC_CONFIG_FILTER_DELAY_48MHZ          (ADC_CONFIG_FILTER_DELAY_4_CYCLES << CYFLD_CSD_FILTER_DELAY__OFFSET)
    #define ADC_CONFIG_SHIELD_DELAY_MASK           (((0x00000001Lu << CYFLD_CSD_SHIELD_DELAY__SIZE) - 1u) << CYFLD_CSD_SHIELD_DELAY__OFFSET)
    #define ADC_CONFIG_SENSE_EN_MASK               (((0x00000001Lu << CYFLD_CSD_SENSE_EN__SIZE) - 1u) << CYFLD_CSD_SENSE_EN__OFFSET)
    #define ADC_CONFIG_CHARGE_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_CHARGE_MODE__SIZE) - 1u) << CYFLD_CSD_CHARGE_MODE__OFFSET)
    #define ADC_CONFIG_MUTUAL_CAP_MASK             (((0x00000001Lu << CYFLD_CSD_MUTUAL_CAP__SIZE) - 1u) << CYFLD_CSD_MUTUAL_CAP__OFFSET)
    #define ADC_CONFIG_CSX_DUAL_CNT_MASK           (((0x00000001Lu << CYFLD_CSD_CSX_DUAL_CNT__SIZE) - 1u) << CYFLD_CSD_CSX_DUAL_CNT__OFFSET)
    #define ADC_CONFIG_DSI_COUNT_SEL_MASK          (((0x00000001Lu << CYFLD_CSD_DSI_COUNT_SEL__SIZE) - 1u) << CYFLD_CSD_DSI_COUNT_SEL__OFFSET)
    #define ADC_CONFIG_DSI_SAMPLE_EN_MASK          (((0x00000001Lu << CYFLD_CSD_DSI_SAMPLE_EN__SIZE) - 1u) << CYFLD_CSD_DSI_SAMPLE_EN__OFFSET)
    #define ADC_CONFIG_SAMPLE_SYNC_MASK            (((0x00000001Lu << CYFLD_CSD_SAMPLE_SYNC__SIZE) - 1u) << CYFLD_CSD_SAMPLE_SYNC__OFFSET)
    #define ADC_CONFIG_DSI_SENSE_EN_MASK           (((0x00000001Lu << CYFLD_CSD_DSI_SENSE_EN__SIZE) - 1u) << CYFLD_CSD_DSI_SENSE_EN__OFFSET)
    #define ADC_CONFIG_LP_MODE_MASK                (((0x00000001Lu << CYFLD_CSD_LP_MODE__SIZE) - 1u) << CYFLD_CSD_LP_MODE__OFFSET)
    #define ADC_CONFIG_ENABLE_MASK                 (((0x00000001Lu << CYFLD_CSD_ENABLE__SIZE) - 1u) << CYFLD_CSD_ENABLE__OFFSET)

    /* Fourth-generation HW block CSD_STATUS register masks    */
    #define ADC_STATUS_CSD_CHARGE_MASK             (((0x00000001Lu << CYFLD_CSD_CSD_CHARGE__SIZE) - 1u) << CYFLD_CSD_CSD_CHARGE__OFFSET)
    #define ADC_STATUS_CSD_SENSE_MASK              (((0x00000001Lu << CYFLD_CSD_CSD_SENSE__SIZE) - 1u) << CYFLD_CSD_CSD_SENSE__OFFSET)
    #define ADC_STATUS_HSCMP_OUT_MASK              (((0x00000001Lu << CYFLD_CSD_HSCMP_OUT__SIZE) - 1u) << CYFLD_CSD_HSCMP_OUT__OFFSET)
    #define ADC_STATUS_CSDCMP_OUT_MASK             (((0x00000001Lu << CYFLD_CSD_CSDCMP_OUT__SIZE) - 1u) << CYFLD_CSD_CSDCMP_OUT__OFFSET)

    /* Fourth-generation HW block STAT_SEQ register masks    */
    #define ADC_STAT_SEQ_SEQ_STATE_MASK            (((0x00000001Lu << CYFLD_CSD_SEQ_STATE__SIZE) - 1u) << CYFLD_CSD_SEQ_STATE__OFFSET)
    #define ADC_STAT_SEQ_ADC_STATE_MASK            (((0x00000001Lu << CYFLD_CSD_ADC_STATE__SIZE) - 1u) << CYFLD_CSD_ADC_STATE__OFFSET)

    /* Fourth-generation HW block sequencer state codes */
    #define ADC_STAT_SEQ_IDLE                      (0x00000000Lu << CYFLD_CSD_SEQ_STATE__OFFSET)
    #define ADC_STAT_SEQ_INIT_COARSE               (0x00000001Lu << CYFLD_CSD_SEQ_STATE__OFFSET)
    #define ADC_STAT_SEQ_AUTO_ZERO_0               (0x00000002Lu << CYFLD_CSD_SEQ_STATE__OFFSET)
    #define ADC_STAT_SEQ_SAMPLE_INIT               (0x00000003Lu << CYFLD_CSD_SEQ_STATE__OFFSET)
    #define ADC_STAT_SEQ_AUTO_ZERO_1               (0x00000004Lu << CYFLD_CSD_SEQ_STATE__OFFSET)
    #define ADC_STAT_SEQ_SAMPLE_NORM               (0x00000005Lu << CYFLD_CSD_SEQ_STATE__OFFSET)


    /* Fourth-generation HW block STAT_CNTS register masks    */
    #define ADC_STAT_CNTS_NUM_CONV_MASK            (((0x00000001Lu << CYFLD_CSD_NUM_CONV__SIZE) - 1u) << CYFLD_CSD_NUM_CONV__OFFSET)

    /* Fourth-generation HW block RESULT_VAL1 register masks    */
    #define ADC_RESULT_VAL1_VALUE_MASK             (((0x00000001Lu << CYFLD_CSD_VALUE__SIZE) - 1u) << CYFLD_CSD_VALUE__OFFSET)
    #define ADC_RESULT_VAL1_BAD_CONVS_MASK         (((0x00000001Lu << CYFLD_CSD_BAD_CONVS__SIZE) - 1u) << CYFLD_CSD_BAD_CONVS__OFFSET)

    /* Fourth-generation HW block RESULT_VAL2 register masks    */
    #define ADC_RESULT_VAL2_VALUE_MASK             (0x0000FFFFLu)

    /* Fourth-generation HW block INTR register masks    */
    #define ADC_INTR_SAMPLE_MASK                   (((0x00000001Lu << CYFLD_CSD_SAMPLE__SIZE) - 1u) << CYFLD_CSD_SAMPLE__OFFSET)
    #define ADC_INTR_INIT_MASK                     (((0x00000001Lu << CYFLD_CSD_INIT__SIZE) - 1u) << CYFLD_CSD_INIT__OFFSET)
    #define ADC_INTR_ADC_RES_MASK                  (((0x00000001Lu << CYFLD_CSD_ADC_RES__SIZE) - 1u) << CYFLD_CSD_ADC_RES__OFFSET)
    #define ADC_CLEAR_MASK                         (0Lu)
    #define ADC_INTR_ALL_MASK                      (ADC_INTR_SAMPLE_MASK | \
                                                                 ADC_INTR_INIT_MASK | \
                                                                 ADC_INTR_ADC_RES_MASK)

    /* Fourth-generation HW block INTR_SET register masks    */
    #define ADC_INTR_SET_SAMPLE_MASK               (ADC_INTR_SAMPLE_MASK)
    #define ADC_INTR_SET_INIT_MASK                 (ADC_INTR_INIT_MASK)
    #define ADC_INTR_SET_ADC_RES_MASK              (ADC_INTR_ADC_RES_MASK)
    #define ADC_INTR_SET_MASK                      (ADC_INTR_SET_SAMPLE_MASK | \
                                                                 ADC_INTR_SET_INIT_MASK | \
                                                                 ADC_INTR_SET_ADC_RES_MASK)

    /* Fourth-generation HW block INTR_MASK register masks    */
    #define ADC_INTR_MASK_SAMPLE_MASK              (ADC_INTR_SAMPLE_MASK)
    #define ADC_INTR_MASK_INIT_MASK                (ADC_INTR_INIT_MASK)
    #define ADC_INTR_MASK_ADC_RES_MASK             (ADC_INTR_ADC_RES_MASK)
    #define ADC_INTR_MASK_CLEAR_MASK               (0uL)


    /* Fourth-generation HW block HSCMP v2 register masks    */
    #define ADC_HSCMP_EN_MASK                      (((0x00000001Lu << CYFLD_CSD_HSCMP_EN__SIZE) - 1u) << CYFLD_CSD_HSCMP_EN__OFFSET)
    #define ADC_HSCMP_INVERT_MASK                  (((0x00000001Lu << CYFLD_CSD_HSCMP_INVERT__SIZE) - 1u) << CYFLD_CSD_HSCMP_INVERT__OFFSET)
    #define ADC_CSD_AZ_EN_MASK                     (((0x00000001Lu << CYFLD_CSD_AZ_EN__SIZE) - 1u) << CYFLD_CSD_AZ_EN__OFFSET)

    /* Fourth-generation HW block AMBUF v2 register masks    */
    #define ADC_AMBUF_AMBUF_EN_MASK                ((0x00000001Lu << CYFLD_CSD_PWR_MODE__SIZE) - 1u)
    #define ADC_AMBUF_PWR_MODE_OFF                 (CYVAL_CSD_PWR_MODE_OFF)
    #define ADC_AMBUF_PWR_MODE_NORM                (CYVAL_CSD_PWR_MODE_NORM)
    #define ADC_AMBUF_PWR_MODE_HI                  (CYVAL_CSD_PWR_MODE_HI)

    /* Fourth-generation HW block REFGEN v2 register masks    */
    #define ADC_REFGEN_REFGEN_EN_MASK              ((0x00000001Lu << CYFLD_CSD_REFGEN_EN__SIZE) - 1u)
    #define ADC_REFGEN_BYPASS_MASK                 (((0x00000001Lu << CYFLD_CSD_BYPASS__SIZE) - 1u) << CYFLD_CSD_BYPASS__OFFSET)
    #define ADC_REFGEN_VDDA_EN_MASK                (((0x00000001Lu << CYFLD_CSD_VDDA_EN__SIZE) - 1u) << CYFLD_CSD_VDDA_EN__OFFSET)
    #define ADC_REFGEN_RES_EN_MASK                 (((0x00000001Lu << CYFLD_CSD_RES_EN__SIZE) - 1u) << CYFLD_CSD_RES_EN__OFFSET)
    #define ADC_REFGEN_GAIN_MASK                   (((0x00000001Lu << CYFLD_CSD_GAIN__SIZE) - 1u) << CYFLD_CSD_GAIN__OFFSET)
    #define ADC_REFGEN_VREFLO_SEL_MASK             (((0x00000001Lu << CYFLD_CSD_VREFLO_SEL__SIZE) - 1u) << CYFLD_CSD_VREFLO_SEL__OFFSET)
    #define ADC_REFGEN_VREFLO_INT_MASK             (((0x00000001Lu << CYFLD_CSD_VREFLO_INT__SIZE) - 1u) << CYFLD_CSD_VREFLO_INT__OFFSET)

    /* Fourth-generation HW block IDACA v2 register masks  */
    #define ADC_IDAC_MOD_VAL_MASK                  (((0x00000001Lu << CYFLD_CSD_VAL__SIZE) - 1u) << CYFLD_CSD_VAL__OFFSET)
    #define ADC_IDAC_MOD_POLARITY_MASK             (((0x00000001Lu << CYFLD_CSD_POLARITY__SIZE) - 1u) << CYFLD_CSD_POLARITY__OFFSET)
    #define ADC_IDAC_MOD_POLARITY_VSSA_SRC         ((uint32)CYVAL_CSD_POLARITY_VSSA_SRC)
    #define ADC_IDAC_MOD_POLARITY_VDDA_SNK         ((uint32)CYVAL_CSD_POLARITY_VDDA_SNK)
    #define ADC_IDAC_MOD_POLARITY_SENSE            ((uint32)CYVAL_CSD_POLARITY_SENSE)
    #define ADC_IDAC_MOD_POLARITY_SENSE_INV        ((uint32)CYVAL_CSD_POLARITY_SENSE_INV)
    #define ADC_IDAC_MOD_POL_DYN_MASK              (((0x00000001Lu << CYFLD_CSD_POL_DYN__SIZE) - 1u) << CYFLD_CSD_POL_DYN__OFFSET)
    #define ADC_IDAC_MOD_BALL_MODE_MASK             (((0x00000001Lu << CYFLD_CSD_BAL_MODE__SIZE) - 1u) << CYFLD_CSD_BAL_MODE__OFFSET)
    #define ADC_IDAC_MOD_BALL_MODE_FULL            (CYVAL_CSD_BAL_MODE_FULL)
    #define ADC_IDAC_MOD_LEG1_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_LEG1_MODE__SIZE) - 1u) << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG1_MODE_GP_STATIC_MASK  (CYVAL_CSD_LEG1_MODE_GP_STATIC)
    #define ADC_IDAC_MOD_LEG1_MODE_GP_MASK         ((uint32)CYVAL_CSD_LEG1_MODE_GP << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG1_MODE_CSD_STATIC      ((uint32)CYVAL_CSD_LEG1_MODE_CSD_STATIC)
    #define ADC_IDAC_MOD_LEG1_MODE_CSD_STATIC_MASK ((uint32)CYVAL_CSD_LEG1_MODE_CSD_STATIC << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG1_MODE_CSD             (0x00000003Lu)
    #define ADC_IDAC_MOD_LEG1_MODE_CSD_MASK        (0x00000003Lu << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG2_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_LEG2_MODE__SIZE) - 1u) << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG2_MODE_GP_STATIC       (CYVAL_CSD_LEG2_MODE_GP_STATIC)
    #define ADC_IDAC_MOD_LEG2_MODE_GP_STATIC_MASK  (CYVAL_CSD_LEG2_MODE_GP_STATIC << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG2_MODE_GP_MASK         ((uint32)CYVAL_CSD_LEG2_MODE_GP << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG2_MODE_CSD_STATIC_MASK (0x00000002Lu << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_MOD_LEG2_MODE_CSD             (0x00000003Lu)
    #define ADC_IDAC_MOD_LEG2_MODE_CSD_MASK        (0x00000003Lu << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_MOD_BAL_MODE_PHI1             ((uint32)CYVAL_CSD_BAL_MODE_PHI1)
    #define ADC_IDAC_MOD_DSI_CTRL_EN_MASK          (0x00200000Lu)
    #define ADC_IDAC_MOD_RANGE_MASK                (0x00C00000Lu)
    #define ADC_IDAC_MOD_RANGE_IDAC_LO             (CYVAL_CSD_RANGE_IDAC_LO)
    #define ADC_IDAC_MOD_RANGE_IDAC_LO_MASK        (0x00000000Lu)
    #define ADC_IDAC_MOD_RANGE_IDAC_MED            (CYVAL_CSD_RANGE_IDAC_MED)
    #define ADC_IDAC_MOD_RANGE_IDAC_MED_MASK       (0x00400000Lu)
    #define ADC_IDAC_MOD_RANGE_IDAC_HI             (CYVAL_CSD_RANGE_IDAC_HI)
    #define ADC_IDAC_MOD_RANGE_IDAC_HI_MASK        (0x00800000Lu)
    #define ADC_IDAC_MOD_LEG1_EN_MASK              (0x01000000Lu)
    #define ADC_IDAC_MOD_LEG2_EN_MASK              (0x02000000Lu)

    /* Fourth-generation HW block IDACB v2 register masks  */
    #define ADC_IDAC_COMP_VAL_MASK                  (((0x00000001Lu << CYFLD_CSD_VAL__SIZE) - 1u) << CYFLD_CSD_VAL__OFFSET)
    #define ADC_IDAC_COMP_POLARITY_MASK             (((0x00000001Lu << CYFLD_CSD_POLARITY__SIZE) - 1u) << CYFLD_CSD_POLARITY__OFFSET)
    #define ADC_IDAC_COMP_POLARITY_VSSA_SRC         ((uint32)CYVAL_CSD_POLARITY_VSSA_SRC)
    #define ADC_IDAC_COMP_POLARITY_VDDA_SNK         ((uint32)CYVAL_CSD_POLARITY_VDDA_SNK)
    #define ADC_IDAC_COMP_POLARITY_SENSE            ((uint32)CYVAL_CSD_POLARITY_SENSE)
    #define ADC_IDAC_COMP_POLARITY_SENSE_INV        ((uint32)CYVAL_CSD_POLARITY_SENSE_INV)
    #define ADC_IDAC_COMP_POL_DYN_MASK              (((0x00000001Lu << CYFLD_CSD_POL_DYN__SIZE) - 1u) << CYFLD_CSD_POL_DYN__OFFSET)
    #define ADC_IDAC_COMP_POL_DYN_STATIC            (0uL)
    #define ADC_IDAC_COMP_POL_DYN_DYNAMIC           (1uL)
    #define ADC_IDAC_COMP_BALL_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_BAL_MODE__SIZE) - 1u) << CYFLD_CSD_BAL_MODE__OFFSET)
    #define ADC_IDAC_COMP_BALL_MODE_FULL            (CYVAL_CSD_BAL_MODE_FULL)
    #define ADC_IDAC_COMP_LEG1_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_LEG1_MODE__SIZE) - 1u) << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG1_MODE_GP_STATIC       (CYVAL_CSD_LEG1_MODE_GP_STATIC)
    #define ADC_IDAC_COMP_LEG1_MODE_GP_STATIC_MASK  (CYVAL_CSD_LEG1_MODE_GP_STATIC << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG1_MODE_GP_MASK         ((uint32)CYVAL_CSD_LEG1_MODE_GP << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG1_MODE_CSD_STATIC      ((uint32)CYVAL_CSD_LEG1_MODE_CSD_STATIC)
    #define ADC_IDAC_COMP_LEG1_MODE_CSD_STATIC_MASK ((uint32)CYVAL_CSD_LEG1_MODE_CSD_STATIC << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG1_MODE_CSD             (0x00000003Lu)
    #define ADC_IDAC_COMP_LEG1_MODE_CSD_MASK        (0x00000003Lu << CYFLD_CSD_LEG1_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG2_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_LEG2_MODE__SIZE) - 1u) << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG2_MODE_GP_STATIC       ((uint32)CYVAL_CSD_LEG2_MODE_GP_STATIC)
    #define ADC_IDAC_COMP_LEG2_MODE_GP_STATIC_MASK  (CYVAL_CSD_LEG2_MODE_GP_STATIC)
    #define ADC_IDAC_COMP_LEG2_MODE_GP_MASK         ((uint32)CYVAL_CSD_LEG2_MODE_GP << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG2_MODE_CSD_STATIC      (0x00000002Lu)
    #define ADC_IDAC_COMP_LEG2_MODE_CSD_STATIC_MASK (0x00000002Lu << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_COMP_LEG2_MODE_CSD             (0x00000003Lu)
    #define ADC_IDAC_COMP_LEG2_MODE_CSD_MASK        (0x00000003Lu << CYFLD_CSD_LEG2_MODE__OFFSET)
    #define ADC_IDAC_COMP_DSI_CTRL_EN_MASK          (0x00200000Lu)
    #define ADC_IDAC_COMP_RANGE_MASK                (0x00C00000Lu)
    #define ADC_IDAC_COMP_RANGE_IDAC_LO             (CYVAL_CSD_RANGE_IDAC_LO)
    #define ADC_IDAC_COMP_RANGE_IDAC_LO_MASK        (0x00000000Lu)
    #define ADC_IDAC_COMP_RANGE_IDAC_MED            (CYVAL_CSD_RANGE_IDAC_MED)
    #define ADC_IDAC_COMP_RANGE_IDAC_MED_MASK       (0x00400000Lu)
    #define ADC_IDAC_COMP_RANGE_IDAC_HI             (CYVAL_CSD_RANGE_IDAC_HI)
    #define ADC_IDAC_COMP_RANGE_IDAC_HI_MASK        (0x00800000Lu)
    #define ADC_IDAC_COMP_LEG1_EN_MASK              (0x01000000Lu)
    #define ADC_IDAC_COMP_LEG2_EN_MASK              (0x02000000Lu)
    #define ADC_IDAC_COMP_LEG3_EN_MASK              (0x04000000Lu)

    /* Fourth-generation HW block SENSE_PERIOD register masks  */
    #define ADC_SENSE_PERIOD_SENSE_DIV_MASK        (((0x00000001Lu << CYFLD_CSD_SENSE_DIV__SIZE) - 1u) << CYFLD_CSD_SENSE_DIV__OFFSET)
    #define ADC_SENSE_PERIOD_LFSR_SIZE_MASK        (((0x00000001Lu << CYFLD_CSD_LFSR_SIZE__SIZE) - 1u) << CYFLD_CSD_LFSR_SIZE__OFFSET)
    #define ADC_SENSE_PERIOD_LFSR_SCALE_MASK       (((0x00000001Lu << CYFLD_CSD_LFSR_SCALE__SIZE) - 1u) << CYFLD_CSD_LFSR_SCALE__OFFSET)
    #define ADC_SENSE_PERIOD_LFSR_CLEAR_MASK       (((0x00000001Lu << CYFLD_CSD_LFSR_CLEAR__SIZE) - 1u) << CYFLD_CSD_LFSR_CLEAR__OFFSET)
    #define ADC_SENSE_PERIOD_SEL_LFSR_MSB_MASK     (((0x00000001Lu << CYFLD_CSD_SEL_LFSR_MSB__SIZE) - 1u) << CYFLD_CSD_SEL_LFSR_MSB__OFFSET)
    #define ADC_SENSE_6MHZ                         (6u)
    #define ADC_SENSE_PERIOD_SENSE_DIV_6MHZ        (CYDEV_BCLK__HFCLK__KHZ/ADC_CSD_SCANSPEED_DIVIDER/ADC_SENSE_6MHZ)

