sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
    /* Fourth-generation HW block SW_BYP_SEL register masks  */
    #define ADC_SW_BYP_SEL_SW_BYA_MASK             (((0x00000001Lu << CYFLD_CSD_SW_BYA__SIZE) - 1u) << CYFLD_CSD_SW_BYA__OFFSET)
    #define ADC_SW_BYP_SEL_SW_BYB_MASK             (((0x00000001Lu << CYFLD_CSD_SW_BYB__SIZE) - 1u) << CYFLD_CSD_SW_BYB__OFFSET)
    #define ADC_SW_BYP_SEL_SW_CBCC_MASK            (((0x00000001Lu << CYFLD_CSD_SW_CBCC__SIZE) - 1u) << CYFLD_CSD_SW_CBCC__OFFSET)

    /* Fourth-generation HW block SW_REFGEN_SEL register masks  */
    #define ADC_SW_REFGEN_SEL_SW_IAIB_MASK         (((0x00000001Lu << CYFLD_CSD_SW_IAIB__SIZE) - 1u) << CYFLD_CSD_SW_IAIB__OFFSET)
    #define ADC_SW_REFGEN_SEL_SW_IBCB_MASK         (((0x00000001Lu << CYFLD_CSD_SW_IBCB__SIZE) - 1u) << CYFLD_CSD_SW_IBCB__OFFSET)
    #define ADC_SW_REFGEN_SEL_SW_SGMB_MASK         (((0x00000001Lu << CYFLD_CSD_SW_SGMB__SIZE) - 1u) << CYFLD_CSD_SW_SGMB__OFFSET)
    #define ADC_SW_REFGEN_SEL_SW_SGRE_MASK         (((0x00000001Lu << CYFLD_CSD_SW_SGRE__SIZE) - 1u) << CYFLD_CSD_SW_SGRE__OFFSET)
    #define ADC_SW_REFGEN_SEL_SW_SGR_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SGR__SIZE) - 1u) << CYFLD_CSD_SW_SGR__OFFSET)
    #define ADC_SW_REFGEN_SEL_SW_MASK              (ADC_SW_REFGEN_SEL_SW_IAIB_MASK |\
                                                                 ADC_SW_REFGEN_SEL_SW_IBCB_MASK |\
                                                                 ADC_SW_REFGEN_SEL_SW_SGMB_MASK |\
                                                                 ADC_SW_REFGEN_SEL_SW_SGRE_MASK |\
                                                                 ADC_SW_REFGEN_SEL_SW_SGR_MASK)

    /* Fourth-generation HW block SW_CMP_N_SEL register masks  */
    #define ADC_SW_CMP_N_SEL_SW_SCRH_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SCRH__SIZE) - 1u) << CYFLD_CSD_SW_SCRH__OFFSET)
    #define ADC_SW_CMP_N_SEL_SW_SCRH_STATIC_OPEN   (ADC_STATIC_OPEN << CYFLD_CSD_SW_SCRH__OFFSET)
    #define ADC_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE  (ADC_STATIC_CLOSE << CYFLD_CSD_SW_SCRH__OFFSET)
    #define ADC_SW_CMP_N_SEL_SW_SCRL_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SCRL__SIZE) - 1u) << CYFLD_CSD_SW_SCRL__OFFSET)
    #define ADC_SW_CMP_N_SEL_SW_SCRL_STATIC_OPEN   (ADC_STATIC_OPEN << CYFLD_CSD_SW_SCRL__OFFSET)
    #define ADC_SW_CMP_N_SEL_SW_SCRL_STATIC_CLOSE  (ADC_STATIC_CLOSE << CYFLD_CSD_SW_SCRL__OFFSET)

    /* Fourth-generation HW block SEQ_TIME register masks  */
    #define ADC_SEQ_TIME_AZ_TIME_MASK              (((0x00000001Lu << CYFLD_CSD_AZ_TIME__SIZE) - 1u) << CYFLD_CSD_AZ_TIME__OFFSET)

    /* Fourth-generation HW block SEQ_INIT_CNT register masks  */
    #define ADC_SEQ_INIT_CNT_CONV_CNT_MASK         (((0x00000001Lu << CYFLD_CSD_CONV_CNT__SIZE) - 1u) << CYFLD_CSD_CONV_CNT__OFFSET)

    /* Fourth-generation HW block SEQ_NORM_CNT register masks  */
    #define ADC_SEQ_NORM_CNT_CONV_CNT_MASK         (((0x00000001Lu << CYFLD_CSD_CONV_CNT__SIZE) - 1u) << CYFLD_CSD_CONV_CNT__OFFSET)

    /* Fourth-generation HW block SW_RES register masks  */
    #define ADC_SW_RES_RES_HCAV_MASK               (((0x00000001Lu << CYFLD_CSD_RES_HCAV__SIZE) - 1u) << CYFLD_CSD_RES_HCAV__OFFSET)
    #define ADC_SW_RES_RES_HCAG_MASK               (((0x00000001Lu << CYFLD_CSD_RES_HCAG__SIZE) - 1u) << CYFLD_CSD_RES_HCAG__OFFSET)
    #define ADC_SW_RES_RES_HCBV_MASK               (((0x00000001Lu << CYFLD_CSD_RES_HCBV__SIZE) - 1u) << CYFLD_CSD_RES_HCBV__OFFSET)
    #define ADC_SW_RES_RES_HCBG_MASK               (((0x00000001Lu << CYFLD_CSD_RES_HCBG__SIZE) - 1u) << CYFLD_CSD_RES_HCBG__OFFSET)
    #define ADC_SW_RES_RES_F1PM_MASK               (((0x00000001Lu << CYFLD_CSD_RES_F1PM__SIZE) - 1u) << CYFLD_CSD_RES_F1PM__OFFSET)
    #define ADC_SW_RES_RES_F2PT_MASK               (((0x00000001Lu << CYFLD_CSD_RES_F2PT__SIZE) - 1u) << CYFLD_CSD_RES_F2PT__OFFSET)

    #define ADC_SW_RES_RES_DEFAULT                 ((ADC_CSD_INIT_SWITCH_RES << CYFLD_CSD_RES_HCAV__OFFSET) | \
                                                                 (ADC_CSD_SHIELD_SWITCH_RES << CYFLD_CSD_RES_HCBV__OFFSET))

    /* Fourth-generation HW block SW_HS_P_SEL register masks  */
    #define ADC_SW_HS_P_SEL_SW_HMPM_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMPM__SIZE) - 1u) << CYFLD_CSD_SW_HMPM__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPM_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMPM__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMPM__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPT_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMPT__SIZE) - 1u) << CYFLD_CSD_SW_HMPT__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPT_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMPT__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMPT__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPS_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMPS__SIZE) - 1u) << CYFLD_CSD_SW_HMPS__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPS_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMPS__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMPS__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMMA_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMMA__SIZE) - 1u) << CYFLD_CSD_SW_HMMA__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMMA_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMMA__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMMA_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMMA__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMMB_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMMB__SIZE) - 1u) << CYFLD_CSD_SW_HMMB__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMMB_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMMB__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMMB__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMCA_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMCA__SIZE) - 1u) << CYFLD_CSD_SW_HMCA__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMCA_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMCA__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMCA_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMCA__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMCB_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMCB__SIZE) - 1u) << CYFLD_CSD_SW_HMCB__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMCB_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMCB__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMCB_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMCB__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMRH_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HMRH__SIZE) - 1u) << CYFLD_CSD_SW_HMRH__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMRH_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HMRH__OFFSET)
    #define ADC_SW_HS_P_SEL_SW_HMRH_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HMRH__OFFSET)

    /* Fourth-generation HW block SW_SHIELD_SEL register masks  */
    #define ADC_SW_SHIELD_SEL_SW_HCAV_MASK         (((0x00000001Lu << CYFLD_CSD_SW_HCAV__SIZE) - 1u) << CYFLD_CSD_SW_HCAV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCAV_STATIC_OPEN  (ADC_STATIC_OPEN)
    #define ADC_SW_SHIELD_SEL_SW_HCAV_HSCMP        (ADC_HSCMP)
    #define ADC_SW_SHIELD_SEL_SW_HCAG_MASK         (((0x00000001Lu << CYFLD_CSD_SW_HCAG__SIZE) - 1u) << CYFLD_CSD_SW_HCAG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_MASK         (((0x00000001Lu << CYFLD_CSD_SW_HCBV__SIZE) - 1u) << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_HSCMP        (ADC_HSCMP << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_PHI1         (ADC_PHI1 << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_PHI2         (ADC_PHI2 << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_PHI1_HSCMP   (ADC_PHI1_HSCMP << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP   (ADC_PHI2_HSCMP << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_STATIC_OPEN  (ADC_STATIC_OPEN << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HCBV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_MASK         (((0x00000001Lu << CYFLD_CSD_SW_HCBG__SIZE) - 1u) << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_HSCMP        (ADC_HSCMP << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_PHI1         (ADC_PHI1 << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_PHI2         (ADC_PHI2 << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_PHI1_HSCMP   (ADC_PHI1_HSCMP << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP   (ADC_PHI2_HSCMP << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBG_STATIC_OPEN  (ADC_STATIC_OPEN << CYFLD_CSD_SW_HCBG__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCCV_MASK         (((0x00000001Lu << CYFLD_CSD_SW_HCCV__SIZE) - 1u) << CYFLD_CSD_SW_HCCV__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCCG_MASK         (((0x00000001Lu << CYFLD_CSD_SW_HCCG__SIZE) - 1u) << CYFLD_CSD_SW_HCCG__OFFSET)

    /* Fourth-generation HW block SEQ_START register masks  */
    #define ADC_SEQ_START_START_MASK               (((0x00000001Lu << CYFLD_CSD_START__SIZE) - 1u) << CYFLD_CSD_START__OFFSET)
    #define ADC_SEQ_START_SEQ_MODE_MASK            (((0x00000001Lu << CYFLD_CSD_SEQ_MODE__SIZE) - 1u) << CYFLD_CSD_SEQ_MODE__OFFSET)
    #define ADC_SEQ_START_ABORT_MASK               (((0x00000001Lu << CYFLD_CSD_ABORT__SIZE) - 1u) << CYFLD_CSD_ABORT__OFFSET)
    #define ADC_SEQ_START_DSI_START_EN_MASK        (((0x00000001Lu << CYFLD_CSD_DSI_START_EN__SIZE) - 1u) << CYFLD_CSD_DSI_START_EN__OFFSET)
    #define ADC_SEQ_START_AZ0_SKIP_MASK            (((0x00000001Lu << CYFLD_CSD_AZ0_SKIP__SIZE) - 1u) << CYFLD_CSD_AZ0_SKIP__OFFSET)
    #define ADC_SEQ_START_AZ1_SKIP_MASK            (((0x00000001Lu << CYFLD_CSD_AZ1_SKIP__SIZE) - 1u) << CYFLD_CSD_AZ1_SKIP__OFFSET)

    /* Fourth-generation HW block SW_CMP_P_SEL register masks  */
    #define ADC_SW_CMP_P_SEL_SW_SFPM_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFPM__SIZE) - 1u) << CYFLD_CSD_SW_SFPM__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPM_STATIC_OPEN   (ADC_STATIC_OPEN << CYFLD_CSD_SW_SFPM__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE  (ADC_STATIC_CLOSE << CYFLD_CSD_SW_SFPM__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPT_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFPT__SIZE) - 1u) << CYFLD_CSD_SW_SFPT__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPT_STATIC_OPEN   (ADC_STATIC_OPEN << CYFLD_CSD_SW_SFPT__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE  (ADC_STATIC_CLOSE << CYFLD_CSD_SW_SFPT__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPS_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFPS__SIZE) - 1u) << CYFLD_CSD_SW_SFPS__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPS_STATIC_OPEN   (ADC_STATIC_OPEN << CYFLD_CSD_SW_SFPS__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFPS_STATIC_CLOSE  (ADC_STATIC_CLOSE << CYFLD_CSD_SW_SFPS__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFMA_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFMA__SIZE) - 1u) << CYFLD_CSD_SW_SFMA__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFMA_STATIC_OPEN   (ADC_STATIC_OPEN << CYFLD_CSD_SW_SFMA__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFMA_STATIC_CLOSE  (ADC_STATIC_CLOSE << CYFLD_CSD_SW_SFMA__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFMB_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFMB__SIZE) - 1u) << CYFLD_CSD_SW_SFMB__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFCA_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFCA__SIZE) - 1u) << CYFLD_CSD_SW_SFCA__OFFSET)
    #define ADC_SW_CMP_P_SEL_SW_SFCB_MASK          (((0x00000001Lu << CYFLD_CSD_SW_SFCB__SIZE) - 1u) << CYFLD_CSD_SW_SFCB__OFFSET)

