sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
    /* Fourth-generation HW block CSDCMP register masks    */
    #define ADC_CSDCMP_CSDCMP_DISABLED             (0uL)
    #define ADC_CSDCMP_CSDCMP_EN_MASK              (((0x00000001Lu << CYFLD_CSD_CSDCMP_EN__SIZE) - 1u) << CYFLD_CSD_CSDCMP_EN__OFFSET)
    #define ADC_CSDCMP_POLARITY_SEL_MASK           (((0x00000001Lu << CYFLD_CSD_POLARITY_SEL__SIZE) - 1u) << CYFLD_CSD_POLARITY_SEL__OFFSET)
    #define ADC_CSDCMP_FEEDBACK_MODE_MASK          (((0x00000001Lu << CYFLD_CSD_FEEDBACK_MODE__SIZE) - 1u) << CYFLD_CSD_FEEDBACK_MODE__OFFSET)
    #define ADC_CSDCMP_AZ_EN_MASK                  (((0x00000001Lu << CYFLD_CSD_AZ_EN__SIZE) - 1u) << CYFLD_CSD_AZ_EN__OFFSET)

    /* Fourth-generation HW block SENSE_DUTY register masks  */
    #define ADC_SENSE_DUTY_SENSE_WIDTH_MASK        (((0x00000001Lu << CYFLD_CSD_SENSE_WIDTH__SIZE) - 1u) << CYFLD_CSD_SENSE_WIDTH__OFFSET)
    #define ADC_SENSE_DUTY_SENSE_POL_MASK          (((0x00000001Lu << CYFLD_CSD_SENSE_POL__SIZE) - 1u) << CYFLD_CSD_SENSE_POL__OFFSET)
    #define ADC_SENSE_DUTY_SENSE_POL_PHI_LOW       (0uL)
    #define ADC_SENSE_DUTY_SENSE_POL_PHI_HIGH      (ADC_SENSE_DUTY_SENSE_POL_MASK)
    #define ADC_SENSE_DUTY_OVERLAP_PHI1_MASK       (((0x00000001Lu << CYFLD_CSD_OVERLAP_PHI1__SIZE) - 1u) << CYFLD_CSD_OVERLAP_PHI1__OFFSET)
    #define ADC_SENSE_DUTY_OVERLAP_PHI2_MASK       (((0x00000001Lu << CYFLD_CSD_OVERLAP_PHI2__SIZE) - 1u) << CYFLD_CSD_OVERLAP_PHI2__OFFSET)

    /* Fourth-generation HW block SW_AMUXBUF_SEL register masks  */
    #define ADC_SW_AMUXBUF_SEL_SW_IRBY_MASK        (((0x00000001Lu << CYFLD_CSD_SW_IRBY__SIZE) - 1u) << CYFLD_CSD_SW_IRBY__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRLB_MASK        (((0x00000001Lu << CYFLD_CSD_SW_IRLB__SIZE) - 1u) << CYFLD_CSD_SW_IRLB__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRLB_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_IRLB__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_ICA_MASK         (((0x00000001Lu << CYFLD_CSD_SW_ICA__SIZE) - 1u) << CYFLD_CSD_SW_ICA__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_ICB_MASK         (((0x00000001Lu << CYFLD_CSD_SW_ICB__SIZE) - 1u) << CYFLD_CSD_SW_ICB__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_ICB_PHI2_HSCMP   (ADC_PHI2_HSCMP << CYFLD_CSD_SW_ICB__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRLI_MASK        (((0x00000001Lu << CYFLD_CSD_SW_IRLI__SIZE) - 1u) << CYFLD_CSD_SW_IRLI__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRH_MASK         (((0x00000001Lu << CYFLD_CSD_SW_IRH__SIZE) - 1u) << CYFLD_CSD_SW_IRH__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRH_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_IRH__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRL_MASK         (((0x00000001Lu << CYFLD_CSD_SW_IRL__SIZE) - 1u) << CYFLD_CSD_SW_IRL__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_IRL_MASK         (((0x00000001Lu << CYFLD_CSD_SW_IRL__SIZE) - 1u) << CYFLD_CSD_SW_IRL__OFFSET)
    #define ADC_SW_AMUXBUF_SEL_SW_DEFAULT          (0x00000000Lu)
    #define ADC_SW_AMUXBUF_SEL_SW_ICB_PHI2         (0x00030000uL)
    #define ADC_SW_AMUXBUF_SEL_SW_ICB_PHI1         (ADC_PHI1 << CYFLD_CSD_SW_ICB__OFFSET)

    /* Fourth-generation HW block SW_FW_TANK_SEL register masks  */
    #define ADC_SW_HS_N_SEL_SW_HCCC_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HCCC__SIZE) - 1u) << CYFLD_CSD_SW_HCCC__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCCC_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HCCC__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCCC_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HCCC__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCCD_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HCCD__SIZE) - 1u) << CYFLD_CSD_SW_HCCD__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCCD_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HCCD__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCCD_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HCCD__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCRH_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HCRH__SIZE) - 1u) << CYFLD_CSD_SW_HCRH__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCRH_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HCRH__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HCRH__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCRL_MASK           (((0x00000001Lu << CYFLD_CSD_SW_HCRL__SIZE) - 1u) << CYFLD_CSD_SW_HCRL__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCRL_STATIC_OPEN    (ADC_STATIC_OPEN << CYFLD_CSD_SW_HCRL__OFFSET)
    #define ADC_SW_HS_N_SEL_SW_HCRL_STATIC_CLOSE   (ADC_STATIC_CLOSE << CYFLD_CSD_SW_HCRL__OFFSET)

    /* Fourth-generation HW block SW_FW_MOD_SEL register masks  */
    #define ADC_SW_FW_MOD_SEL_SW_F1PM_MASK         (((0x00000001Lu << CYFLD_CSD_SW_F1PM__SIZE) - 1u) << CYFLD_CSD_SW_F1PM__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F1PM__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_F1MA_MASK         (((0x00000001Lu << CYFLD_CSD_SW_F1MA__SIZE) - 1u) << CYFLD_CSD_SW_F1MA__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_F1MA_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F1MA__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_F1CA_MASK         (((0x00000001Lu << CYFLD_CSD_SW_F1CA__SIZE) - 1u) << CYFLD_CSD_SW_F1CA__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_F1CA_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F1CA__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_C1CC_MASK         (((0x00000001Lu << CYFLD_CSD_SW_C1CC__SIZE) - 1u) << CYFLD_CSD_SW_C1CC__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_C1CC_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_C1CC__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_C1CD_MASK         (((0x00000001Lu << CYFLD_CSD_SW_C1CD__SIZE) - 1u) << CYFLD_CSD_SW_C1CD__OFFSET)
    #define ADC_SW_FW_MOD_SEL_SW_C1CD_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_C1CD__OFFSET)

    /* Fourth-generation HW block SW_FW_TANK_SEL register masks  */
    #define ADC_SW_FW_TANK_SEL_SW_F2PT_MASK        (((0x00000001Lu << CYFLD_CSD_SW_F2PT__SIZE) - 1u) << CYFLD_CSD_SW_F2PT__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F2PT__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2CB_MASK        (((0x00000001Lu << CYFLD_CSD_SW_F2CB__SIZE) - 1u) << CYFLD_CSD_SW_F2CB__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F2CB__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2CB_PHI2        (ADC_PHI2 << CYFLD_CSD_SW_F2CB__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2MA_MASK        (((0x00000001Lu << CYFLD_CSD_SW_F2MA__SIZE) - 1u) << CYFLD_CSD_SW_F2MA__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F2MA__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2CA_MASK        (((0x00000001Lu << CYFLD_CSD_SW_F2CA__SIZE) - 1u) << CYFLD_CSD_SW_F2CA__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_F2CA__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_C2CC_MASK        (((0x00000001Lu << CYFLD_CSD_SW_C2CC__SIZE) - 1u) << CYFLD_CSD_SW_C2CC__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_C2CC_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_C2CC__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_C2CD_MASK        (((0x00000001Lu << CYFLD_CSD_SW_C2CD__SIZE) - 1u) << CYFLD_CSD_SW_C2CD__OFFSET)
    #define ADC_SW_FW_TANK_SEL_SW_C2CD_STATIC_CLOSE (ADC_STATIC_CLOSE << CYFLD_CSD_SW_C2CD__OFFSET)

    /* Fourth-generation HW block CTANK masks    */
    #define ADC_CTANK_DR_VDDIO                     (0x0u)
    #define ADC_CTANK_DR_VSSIO                     (ADC_DR_MASK << ADC_CSH_SHIFT)

    #define ADC_CALIBRATE_SW_REFGEN_SEL            (ADC_SW_REFGEN_SEL_SW_SGR_MASK)

    #define ADC_DEFAULT_REFGEN_GAIN                (ADC_CSD_GAIN << CYFLD_CSD_GAIN__OFFSET)
    #define ADC_REFGEN_LV                          (ADC_REFGEN_REFGEN_EN_MASK |\
                                                                ADC_REFGEN_BYPASS_MASK)

    #define ADC_REFGEN_HV                          (ADC_REFGEN_REFGEN_EN_MASK |\
                                                                ADC_REFGEN_RES_EN_MASK |\
                                                                ADC_DEFAULT_REFGEN_GAIN)

