sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
    #define ADC_SENSE_PERIOD_LFSR_SIZE_SHIFT       (CYFLD_CSD_LFSR_SIZE__OFFSET)

    /* Initial PRS mode */
    #define ADC_PRS_8_CONFIG                       (ADC_CLK_SOURCE_PRS8)
    #define ADC_PRS_12_CONFIG                      (ADC_CLK_SOURCE_PRS12)

    /* SW_HS_P_SEL switches state for Coarse initialization of CMOD (sense path) */
    #if (ADC_ENABLE == ADC_CSD_EN)
        #if (ADC_CSD__CMOD_PAD == ADC_CMOD_CONNECTION)
            #define ADC_HS_P_SEL_COARSE_CMOD       (ADC_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
        #elif (ADC_CSD__CSHIELD_PAD == ADC_CMOD_CONNECTION)
            #define ADC_HS_P_SEL_COARSE_CMOD       (ADC_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
        #else
            #define ADC_HS_P_SEL_COARSE_CMOD       (ADC_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
        #endif /* (ADC_CSD__CMOD_PAD == ADC_CMOD_CONNECTION) */
    #else
        #define ADC_HS_P_SEL_COARSE_CMOD           (0x00000000uL)
    #endif /* (ADC_ENABLE == ADC_CSD_EN) */

    #if ((0u != ADC_CSD_SHIELD_TANK_EN) && (ADC_ENABLE == ADC_CSD_SHIELD_EN))
        /* SW_HS_P_SEL switches state for Coarse initialization of CTANK (sense path) */
        #if (ADC_CSD__CSH_TANK_PAD == ADC_CTANK_CONNECTION)
            #define ADC_HS_P_SEL_COARSE_TANK       (ADC_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
            #define ADC_HS_P_SEL_SCAN_TANK         (ADC_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE)
        #elif (ADC_CSD__CSHIELD_PAD == ADC_CTANK_CONNECTION)
            #define ADC_HS_P_SEL_COARSE_TANK       (ADC_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
            #define ADC_HS_P_SEL_SCAN_TANK         (ADC_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE)
        #elif (ADC_CSD__CMOD_PAD == ADC_CTANK_CONNECTION)
            #define ADC_HS_P_SEL_COARSE_TANK       (ADC_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
            #define ADC_HS_P_SEL_SCAN_TANK         (ADC_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE)
        #else
            #define ADC_HS_P_SEL_COARSE_TANK       (ADC_SW_HS_P_SEL_SW_HMMA_STATIC_CLOSE)
            #define ADC_HS_P_SEL_SCAN_TANK         (ADC_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
        #endif /* (ADC_CSD__CSH_TANK_PAD == ADC_CTANK_CONNECTION) */
        #define ADC_SW_HS_P_SEL_SCAN               (ADC_HS_P_SEL_SCAN_TANK)
    #else
        #define ADC_HS_P_SEL_COARSE_TANK           (0x00000000uL)
        #define ADC_SW_HS_P_SEL_SCAN               (ADC_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE)
    #endif /* ((0u != ADC_CSD__CSD_CSH_TANK_ENABLE) && (ADC_ENABLE == ADC_CSD_SHIELD_EN)) */

    #define ADC_SW_HS_P_SEL_COARSE                 (ADC_HS_P_SEL_COARSE_CMOD | ADC_HS_P_SEL_COARSE_TANK)

    /***************************************
    * Fourth-generation HW block Registers shifts
    ***************************************/
    #define ADC_SHIELD_DELAY_SHIFT                 (CYFLD_CSD_SHIELD_DELAY__OFFSET)
    #define ADC_LFSR_SIZE_SHIFT                    (CYFLD_CSD_LFSR_SIZE__OFFSET)
    #define ADC_RESULT_VAL1_BAD_CONVS_SHIFT        (CYFLD_CSD_BAD_CONVS__OFFSET)
    #define ADC_SW_SHIELD_SEL_SW_HCBV_SHIFT        (CYFLD_CSD_SW_HCBV__OFFSET)

    /***************************************
    * LFSR Register masks
    ***************************************/
    #define ADC_RESOLUTION_OFFSET                  (0u)
    #define ADC_LFSR_TABLE_SIZE                    (4u)

    #define ADC_PRS_LENGTH_2_BITS                  (0x00000003Lu)
    #define ADC_PRS_LENGTH_3_BITS                  (0x00000007Lu)
    #define ADC_PRS_LENGTH_4_BITS                  (0x0000000FLu)
    #define ADC_PRS_LENGTH_5_BITS                  (0x0000001FLu)
    #define ADC_PRS_LENGTH_8_BITS                  (0x000000FFLu)
    #define ADC_PRS_LENGTH_12_BITS                 (0x00000FFFLu)

    #if(ADC_ENABLE != ADC_CSDV2_REF9P6UA_EN)
        #define ADC_SNSCLK_SSC1_PERIOD             (3u)
        #define ADC_SNSCLK_SSC2_PERIOD             (7u)
        #define ADC_SNSCLK_SSC3_PERIOD             (15u)
        #define ADC_SNSCLK_SSC4_PERIOD             (31u)

        #define ADC_SNSCLK_SSC1_RANGE              (1u)
        #define ADC_SNSCLK_SSC2_RANGE              (3u)
        #define ADC_SNSCLK_SSC3_RANGE              (7u)
        #define ADC_SNSCLK_SSC4_RANGE              (15u)
    #else

        #define ADC_SNSCLK_SSC1_PERIOD             (63u)
        #define ADC_SNSCLK_SSC2_PERIOD             (127u)
        #define ADC_SNSCLK_SSC3_PERIOD             (511u)
        #define ADC_SNSCLK_SSC4_PERIOD             (1023u)

        #define ADC_SNSCLK_SSC1_RANGE              (16u)
        #define ADC_SNSCLK_SSC2_RANGE              (16u)
        #define ADC_SNSCLK_SSC3_RANGE              (16u)
        #define ADC_SNSCLK_SSC4_RANGE              (16u)
    #endif /* (ADC_ENABLE != ADC_CSDV2_REF9P6UA_EN) */

    #define ADC_LFSR_DITHER_PERCENTAGE             (10uL)
    #define ADC_SNSCLK_SSC1_THRESHOLD              (ADC_LFSR_DITHER_PERCENTAGE * ADC_SNSCLK_SSC1_RANGE)
    #define ADC_SNSCLK_SSC2_THRESHOLD              (ADC_LFSR_DITHER_PERCENTAGE * ADC_SNSCLK_SSC2_RANGE)
    #define ADC_SNSCLK_SSC3_THRESHOLD              (ADC_LFSR_DITHER_PERCENTAGE * ADC_SNSCLK_SSC3_RANGE)
    #define ADC_SNSCLK_SSC4_THRESHOLD              (ADC_LFSR_DITHER_PERCENTAGE * ADC_SNSCLK_SSC4_RANGE)

    #define ADC_HFCLK_SNSCLK_FACTOR                (160u)
    #define ADC_SKIP_INIT_CYCLES                   (4u)

#else

    /* Third-generation HW block CSD_CONFIG register masks    */
    #define ADC_CONFIG_BYPASS_SEL_MASK             (0x00000004Lu)
    #define ADC_CONFIG_FILTER_EN_MASK              (0x00000008Lu)
    #define ADC_CONFIG_DUAL_CAP_EN_MASK            (0x00000010Lu)
    #define ADC_CONFIG_PRS_CLEAR_MASK              (0x00000020Lu)
    #define ADC_CONFIG_PRS_SELECT_MASK             (0x00000040Lu)
    #define ADC_CONFIG_PRS_12_8_MASK               (0x00000080Lu)
    #define ADC_CONFIG_SHIELD_DELAY_MASK           (0x00000600Lu)
    #define ADC_CONFIG_SENSE_COMP_BW_MASK          (0x00000800Lu)
    #define ADC_CONFIG_SENSE_EN_MASK               (0x00001000Lu)
    #define ADC_CONFIG_REFBUF_EN_MASK              (0x00002000Lu)
    #define ADC_CONFIG_COMP_MODE_MASK              (0x00004000Lu)
    #define ADC_CONFIG_COMP_PIN_MASK               (0x00008000Lu)
    #define ADC_CONFIG_POLARITY_MASK               (0x00010000Lu)
    #define ADC_CONFIG_POLARITY2_MASK              (0x00020000Lu)
    #define ADC_CONFIG_MUTUALCAP_EN_MASK           (0x00040000Lu)
    #define ADC_CONFIG_SENSE_COMP_EN_MASK          (0x00080000Lu)
    #define ADC_CONFIG_REFBUF_OUTSEL_MASK          (0x00200000Lu)
    #define ADC_CONFIG_SENSE_INSEL_MASK            (0x00400000Lu)
    #define ADC_CONFIG_REFBUF_DRV_MASK             (0x01800000Lu)
    #define ADC_CONFIG_DDFTSEL_MASK                (0x1C000000Lu)
    #define ADC_CONFIG_ADFTEN_MASK                 (0x20000000Lu)
    #define ADC_CONFIG_DDFT_COMP_MASK              (0x40000000Lu)
    #define ADC_CONFIG_ENABLE_MASK                 (0x80000000Lu)

    /* Third-generation HW block CSD_IDAC register masks  */
    #define ADC_IDAC_MOD_MASK                      (0x000000FFLu)
    #define ADC_IDAC_MOD_MODE_MASK                 (0x00000300Lu)
    #define ADC_IDAC_MOD_RANGE_MASK                (0x00000400Lu)
    #define ADC_IDAC_POLARITY1_MIR_MASK            (0x00001000Lu)
    #define ADC_IDAC_COMP_MASK                     (0x007F0000Lu)
    #define ADC_IDAC_COMP_MODE_MASK                (0x03000000Lu)
    #define ADC_IDAC_COMP_RANGE_MASK               (0x04000000Lu)
    #define ADC_IDAC_POLARITY2_MIR_MASK            (0x10000000Lu)
    #define ADC_IDAC_FEEDBACK_MODE_MASK            (0x40000000Lu)
    #define ADC_IDAC_MOD_MODE_OFF                  (0x00000000Lu)
    #define ADC_IDAC_MOD_MODE_FIXED                (0x00000100Lu)
    #define ADC_IDAC_MOD_MODE_VARIABLE             (0x00000200Lu)
    #define ADC_IDAC_MOD_MODE_DSI                  (0x00000300Lu)
    #define ADC_IDAC_COMP_MODE_OFF                 (0x00000000Lu)
    #define ADC_IDAC_COMP_MODE_FIXED               (0x01000000Lu)
    #define ADC_IDAC_COMP_MODE_VARIABLE            (0x02000000Lu)
    #define ADC_IDAC_COMP_MODE_DSI                 (0x03000000Lu)
    #define ADC_IDAC_MOD_VALUE_SHIFT               (0u)
    #define ADC_IDAC_MOD_CFG_MASK                  (ADC_IDAC_POLARITY1_MIR_MASK |\
                                                                 ADC_IDAC_MOD_RANGE_MASK |\
                                                                 ADC_IDAC_MOD_MODE_MASK |\
                                                                 ADC_IDAC_MOD_MASK)

    #define ADC_IDAC_COMP_CFG_MASK                 (ADC_IDAC_POLARITY2_MIR_MASK |\
                                                                 ADC_IDAC_COMP_RANGE_MASK |\
                                                                 ADC_IDAC_COMP_MODE_MASK |\
                                                                 ADC_IDAC_COMP_MASK)

    /* Third-generation HW block CSD_COUNTER register masks   */
    #define ADC_COUNTER_COUNTER_MASK               (0x0000FFFFLu)
    #define ADC_COUNTER_PERIOD_MASK                (0xFFFF0000Lu)

    /* Third-generation HW block CSD_STATUS register masks    */
    #define ADC_STATUS_CSD_CHARGE_MASK             (0x00000001Lu)
    #define ADC_STATUS_CSD_SENSE_MASK              (0x00000002Lu)
    #define ADC_STATUS_COMP_OUT_MASK               (0x00000004Lu)
    #define ADC_STATUS_SAMPLE                      (0x00000008Lu)

    /* Third-generation HW block CSD_INTR, CSD_INTR_SET register masks  */
    #define ADC_INTR_CSD_MASK                      (0x00000001Lu)
    #define ADC_INTR_SET_CSD_MASK                  (0x00000001Lu)
    #define ADC_INTR_SET_MASK                      (ADC_INTR_SET_CSD_MASK)

    /* Third-generation HW block CSD_PWM register masks   */
    #define ADC_PWM_COUNT_MASK                     (0x0000000FLu)
    #define ADC_PWM_SEL_MASK                       (0x00000030Lu)

    /* Third-generation HW block CSD_TRIM1/2 (for IDAC) register masks    */
    #define ADC_IDAC_TRIM2_MOD_SNK_MASK            (0x0000000FLu)
    #define ADC_IDAC_TRIM2_COMP_SNK_MASK           (0x000000F0Lu)
    #define ADC_IDAC_TRIM1_MOD_SRC_MASK            (0x0000000FLu)
    #define ADC_IDAC_TRIM1_COMP_SRC_MASK           (0x000000F0Lu)

    /* Third-generation HW block CSD_TRIM FLASH register masks    */
    #define ADC_SFLASH_TRIM_IDAC_MOD_MASK          (0x0FLu)
    #define ADC_SFLASH_TRIM_IDAC_COMP_MASK         (0xF0Lu)

    /* Third-generation HW block Clock register masks    */
    #define ADC_SNSCLK_CMD_DIV_SHIFT               (0u)
    #define ADC_SNSCLK_CMD_PA_DIV_SHIFT            (8u)
    #define ADC_SNSCLK_CMD_DISABLE_SHIFT           (30u)
    #define ADC_SNSCLK_CMD_ENABLE_SHIFT            (31u)
    #define ADC_SNSCLK_CMD_DISABLE_MASK            ((uint32)((uint32)1u << ADC_SNSCLK_CMD_DISABLE_SHIFT))
    #define ADC_SNSCLK_CMD_ENABLE_MASK             ((uint32)((uint32)1u << ADC_SNSCLK_CMD_ENABLE_SHIFT))

    /* Third-generation HW block CTANK masks    */
    #define ADC_CTANK_DR_VDDIO                     (0x0u)
    #define ADC_CTANK_DR_VSSIO                     (ADC_DR_MASK << ADC_CSH_SHIFT)

    #define ADC_RESOLUTION_OFFSET                  (16u)
    #define ADC_PRS_LENGTH_12_BITS                 (0x00000FFFLu)
    #define ADC_PRS_LENGTH_8_BITS                  (0x000000FFLu)
    #define ADC_CSD_PRS_12_BIT                     (ADC_CONFIG_PRS_12_8_MASK)
    #define ADC_PRS_MODE_MASK                      (ADC_CONFIG_PRS_12_8_MASK)

