sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
    /* Third-generation HW block Set IDAC polarity */
    #if (ADC_CSD_IDAC_CONFIG == ADC_IDAC_SINKING)
        #define ADC_DEFAULT_IDAC_POLARITY          ADC_CONFIG_POLARITY_MASK
        #define ADC_CSH_DR_CONFIG                  ADC_CTANK_DR_VDDIO
    #else
        #define ADC_DEFAULT_IDAC_POLARITY          (0u)
        #define ADC_CSH_DR_CONFIG                  ADC_CTANK_DR_VSSIO
    #endif /* (ADC_CSD_IDAC_CONFIG == ADC_IDAC_SINKING) */
    
    /* Defining default CSD configuration according to settings in customizer. */
    #define ADC_CSD_ENABLE_MASK                    (ADC_CONFIG_ENABLE_MASK |\
                                                                ADC_CONFIG_SENSE_EN_MASK |\
                                                                ADC_CONFIG_SENSE_COMP_EN_MASK)
    
    /***************************************
    * Third-generation HW block Registers shifts
    ***************************************/
    #define ADC_SHIELD_DELAY_SHIFT                 (0x09u)
    #define ADC_IDAC_COMP_DATA_OFFSET              (16u)

#endif /* (ADC_ENABLE == ADC_CSDV2) */

/* Third-generation and Fourth-generation HW block Clock register masks    */
#define ADC_MODCLK_CMD_DIV_SHIFT                   (0u)
#define ADC_MODCLK_CMD_PA_DIV_SHIFT                (8u)
#define ADC_MODCLK_CMD_DISABLE_SHIFT               (30u)
#define ADC_MODCLK_CMD_ENABLE_SHIFT                (31u)
#define ADC_MODCLK_CMD_DISABLE_MASK                ((uint32)((uint32)1u << ADC_MODCLK_CMD_DISABLE_SHIFT))
#define ADC_MODCLK_CMD_ENABLE_MASK                 ((uint32)((uint32)1u << ADC_MODCLK_CMD_ENABLE_SHIFT))

/* CintB and CintA pin registers  */
#if ((ADC_ENABLE == ADC_CSX_EN) || \
     (ADC_ENABLE == ADC_ISX_EN))

    #define ADC_CintA_PC_REG                       (* (reg32 *) ADC_CintA__0__PC)
    #define ADC_CintA_DR_REG                       (* (reg32 *) ADC_CintA__0__DR)
    #define ADC_CintA_HSIOM_REG                    (* (reg32 *) ADC_CintA__0__HSIOM)
    #define ADC_CintB_PC_REG                       (* (reg32 *) ADC_CintB__0__PC)
    #define ADC_CintB_DR_REG                       (* (reg32 *) ADC_CintB__0__DR)
    #define ADC_CintB_HSIOM_REG                    (* (reg32 *) ADC_CintB__0__HSIOM)

    #define ADC_CintA_PC_PTR                       ((reg32 *) ADC_CintA__0__PC)
    #define ADC_CintA_DR_PTR                       ((reg32 *) ADC_CintA__0__DR)
    #define ADC_CintA_HSIOM_PTR                    ((reg32 *) ADC_CintA__0__HSIOM)
    #define ADC_CintB_PC_PTR                       ((reg32 *) ADC_CintB__0__PC)
    #define ADC_CintB_DR_PTR                       ((reg32 *) ADC_CintB__0__DR)
    #define ADC_CintB_HSIOM_PTR                    ((reg32 *) ADC_CintB__0__HSIOM)

    /* CintB and CintA pin masks                                                */
    #define ADC_CintA_HSIOM_MASK                   ((uint32)ADC_CintA__0__HSIOM_MASK)
    #define ADC_CintA_HSIOM_SHIFT                  ((uint32)ADC_CintA__0__HSIOM_SHIFT)
    #define ADC_CintA_SHIFT                        ((uint32)ADC_CintA__0__SHIFT)

    #define ADC_CintB_HSIOM_MASK                   ((uint32)ADC_CintB__0__HSIOM_MASK)
    #define ADC_CintB_HSIOM_SHIFT                  ((uint32)ADC_CintB__0__HSIOM_SHIFT)
    #define ADC_CintB_SHIFT                        ((uint32)ADC_CintB__0__SHIFT)

#endif

/* CMOD and CSH capacitor port-pins registers */
#if (ADC_ENABLE == ADC_CSD_EN)

    #define ADC_CSH_PC_REG                         (* (reg32 *) ADC_Csh__PC)
    #define ADC_CSH_PC_PTR                         (  (reg32 *) ADC_Csh__PC)
    #define ADC_CSH_DR_REG                         (* (reg32 *) ADC_Csh__DR)
    #define ADC_CSH_DR_PTR                         (  (reg32 *) ADC_Csh__DR)
    #define ADC_CSH_HSIOM_REG                      (* (reg32 *) ADC_Csh__0__HSIOM)
    #define ADC_CSH_HSIOM_PTR                      (  (reg32 *) ADC_Csh__0__HSIOM)

    #define ADC_CMOD_PC_REG                        (* (reg32 *) ADC_Cmod__PC)
    #define ADC_CMOD_PC_PTR                        (  (reg32 *) ADC_Cmod__PC)
    #define ADC_CMOD_PC_SHIFT                      (ADC_Cmod__0__SHIFT * 3u)
    #define ADC_CMOD_DR_REG                        (* (reg32 *) ADC_Cmod__DR)
    #define ADC_CMOD_DR_PTR                        (  (reg32 *) ADC_Cmod__DR)
    #define ADC_CMOD_DR_SHIFT                      ADC_Cmod__0__SHIFT
    #define ADC_CMOD_HSIOM_REG                     (* (reg32 *) ADC_Cmod__0__HSIOM)
    #define ADC_CMOD_HSIOM_PTR                     (  (reg32 *) ADC_Cmod__0__HSIOM)

    /* Cmod and Csh pin masks */
    #define ADC_CMOD_HSIOM_MASK                    ADC_Cmod__0__HSIOM_MASK
    #define ADC_CMOD_HSIOM_SHIFT                   ADC_Cmod__0__HSIOM_SHIFT
    #define ADC_CSH_HSIOM_MASK                     ADC_Csh__0__HSIOM_MASK
    #define ADC_CSH_HSIOM_SHIFT                    ADC_Csh__0__HSIOM_SHIFT
    #define ADC_CSH_SHIFT                          ADC_Csh__0__SHIFT
    #define ADC_CSH_PC_SHIFT                       (ADC_Csh__0__SHIFT * 3u)

#endif

/* GPIO register masks */
#define ADC_DR_MASK                                (0x00000001Lu)

#define ADC_CSH_PC_MASK                            (0x00000007Lu)
#define ADC_CSH_PC_STRONG_MODE                     (0x00000006Lu)

#define ADC_HSIOM_SEL_MASK                         (0x0000000FLu)
#define ADC_HSIOM_SEL_GPIO                         (0x00000000Lu)
#define ADC_HSIOM_SEL_CSD_SENSE                    (0x00000004Lu)
#define ADC_HSIOM_SEL_CSD_SHIELD                   (0x00000005Lu)
#define ADC_HSIOM_SEL_AMUXA                        (0x00000006Lu)
#define ADC_HSIOM_SEL_AMUXB                        (0x00000007Lu)
#define ADC_HSIOM_SEL_ACT_0                        (0x00000008Lu)

#define ADC_GPIO_PC_MASK                           (0x00000007Lu)
#define ADC_GPIO_HIGHZ                             (0x00000000Lu)
#define ADC_GPIO_STRGDRV                           (0x00000006Lu)

#define ADC_SNS_GROUND_CONNECT                     (0x00000006Lu)

#define ADC_GPIO_PC_BIT_SIZE                       (3u)

#define ADC_EXT_CAP_DISCHARGE_TIME                 (1u)

#define ADC_SW_WATCHDOG_SCAN_ALL                   (5000000u)

#if (ADC_ENABLE == ADC_CSD_EN)
    #define ADC_EXT_CAP_HSIOM_PTR                  ((reg32 *) ADC_Cmod__0__HSIOM)
    #define ADC_EXT_CAP_DR_PTR                     ((reg32 *) ADC_Cmod__DR)
    #define ADC_EXT_CAP_PC_PTR                     ((reg32 *) ADC_Cmod__PC)
#else
    #define ADC_EXT_CAP_HSIOM_PTR                  ((reg32 *) ADC_CintA__0__HSIOM)
    #define ADC_EXT_CAP_DR_PTR                     ((reg32 *) ADC_CintA__DR)
    #define ADC_EXT_CAP_PC_PTR                     ((reg32 *) ADC_CintA__PC)
#endif

#if (ADC_ENABLE == ADC_CSD_EN)
    #define ADC_EXT_CAP_HSIOM_MASK_CMOD                (ADC_Cmod__0__HSIOM_MASK)
    #define ADC_EXT_CAP_DR_MASK_CMOD                   (ADC_Cmod__0__MASK)
    #define ADC_EXT_CAP_PC_MASK_CMOD                   ((uint32)ADC_GPIO_PC_MASK << ADC_CMOD_PC_SHIFT)
    #define ADC_EXT_CAP_PC_STRONG_CFG_CMOD             ((uint32)ADC_GPIO_STRGDRV << ADC_CMOD_PC_SHIFT)
#else
    #define ADC_EXT_CAP_HSIOM_MASK_CMOD                (0u)
    #define ADC_EXT_CAP_DR_MASK_CMOD                   (0u)
    #define ADC_EXT_CAP_PC_MASK_CMOD                   (0u)
    #define ADC_EXT_CAP_PC_STRONG_CFG_CMOD             (0u)
#endif

#if((ADC_ENABLE == ADC_CSD_EN) && \
    (ADC_ENABLE == ADC_CSD_SHIELD_EN) && \
    (ADC_ENABLE == ADC_CSD_SHIELD_TANK_EN))
    #define ADC_EXT_CAP_HSIOM_MASK_CSH                 (ADC_Csh__0__HSIOM_MASK)
    #define ADC_EXT_CAP_DR_MASK_CSH                    (ADC_Csh__0__MASK)
    #define ADC_EXT_CAP_PC_MASK_CSH                    ((uint32)ADC_GPIO_PC_MASK << ADC_CSH_PC_SHIFT)
    #define ADC_EXT_CAP_PC_STRONG_CFG_CSH             ((uint32)ADC_GPIO_STRGDRV << ADC_CSH_PC_SHIFT)
#else
    #define ADC_EXT_CAP_HSIOM_MASK_CSH                 (0u)
    #define ADC_EXT_CAP_DR_MASK_CSH                    (0u)
    #define ADC_EXT_CAP_PC_MASK_CSH                    (0u)
    #define ADC_EXT_CAP_PC_STRONG_CFG_CSH              (0u)
#endif

#if (ADC_ENABLE == ADC_CSX_EN)
    #define ADC_EXT_CAP_HSIOM_MASK_CINTA               (ADC_CintA__0__HSIOM_MASK)
    #define ADC_EXT_CAP_DR_MASK_CINTA                  (ADC_CintA__0__MASK)
    #define ADC_EXT_CAP_PC_MASK_CINTA                  ((uint32)ADC_GPIO_PC_MASK << (ADC_CintA_SHIFT * 3u))
    #define ADC_EXT_CAP_PC_STRONG_CFG_CINTA            ((uint32)ADC_GPIO_STRGDRV << (ADC_CintA_SHIFT * 3u))
    #define ADC_EXT_CAP_HSIOM_MASK_CINTB               (ADC_CintB__0__HSIOM_MASK)
    #define ADC_EXT_CAP_DR_MASK_CINTB                  (ADC_CintB__0__MASK)
    #define ADC_EXT_CAP_PC_MASK_CINTB                  ((uint32)ADC_GPIO_PC_MASK << (ADC_CintB_SHIFT * 3u))
    #define ADC_EXT_CAP_PC_STRONG_CFG_CINTB            ((uint32)ADC_GPIO_STRGDRV << (ADC_CintB_SHIFT * 3u))
#else
    #define ADC_EXT_CAP_HSIOM_MASK_CINTA               (0u)
    #define ADC_EXT_CAP_DR_MASK_CINTA                  (0u)
    #define ADC_EXT_CAP_PC_MASK_CINTA                  (0u)
    #define ADC_EXT_CAP_PC_STRONG_CFG_CINTA            (0u)
    #define ADC_EXT_CAP_HSIOM_MASK_CINTB               (0u)
    #define ADC_EXT_CAP_DR_MASK_CINTB                  (0u)
    #define ADC_EXT_CAP_PC_MASK_CINTB                  (0u)
    #define ADC_EXT_CAP_PC_STRONG_CFG_CINTB            (0u)
#endif

/* External capacitors related to the all enabled methods */
#define ADC_EXT_CAP_HSIOM_MASK                         (ADC_EXT_CAP_HSIOM_MASK_CMOD | \
                                                                     ADC_EXT_CAP_HSIOM_MASK_CSH | \
                                                                     ADC_EXT_CAP_HSIOM_MASK_CINTA | \
                                                                     ADC_EXT_CAP_HSIOM_MASK_CINTB)

#define ADC_EXT_CAP_DR_MASK                            (ADC_EXT_CAP_DR_MASK_CMOD | \
                                                                     ADC_EXT_CAP_DR_MASK_CSH | \
                                                                     ADC_EXT_CAP_DR_MASK_CINTA | \
                                                                     ADC_EXT_CAP_DR_MASK_CINTB)

