sunwookim05/Yellow-Chip/RGB_Led.cydsn/Generated_Source/PSoC4/ADC_Sensing.h
#define ADC_EXT_CAP_PC_MASK                            (ADC_EXT_CAP_PC_MASK_CMOD | \
                                                                     ADC_EXT_CAP_PC_MASK_CSH | \
                                                                     ADC_EXT_CAP_PC_MASK_CINTA | \
                                                                     ADC_EXT_CAP_PC_MASK_CINTB)

#define ADC_EXT_CAP_PC_STRONG_CFG                      (ADC_EXT_CAP_PC_STRONG_CFG_CMOD | \
                                                                     ADC_EXT_CAP_PC_STRONG_CFG_CSH | \
                                                                     ADC_EXT_CAP_PC_STRONG_CFG_CINTA | \
                                                                     ADC_EXT_CAP_PC_STRONG_CFG_CINTB)


/***************************************
* API Constants
***************************************/

#define ADC_MOD_CSD_CLK_12MHZ                      (12000000uL)
#define ADC_MOD_CSD_CLK_24MHZ                      (24000000uL)
#define ADC_MOD_CSD_CLK_48MHZ                      (48000000uL)

#if (ADC_ENABLE == ADC_CSDV2)
    #define ADC_MIN_SNS_CLK_DIVIDER                (4000u)
#else
    #define ADC_MIN_SNS_CLK_DIVIDER                (1000u)
#endif /* (ADC_ENABLE == ADC_CSDV2) */

/* ISR Number to work with CyLib functions */
#define ADC_ISR_NUMBER                             (ADC_ISR__INTC_NUMBER)

/* Multi-frequency scanning constants */
#define ADC_FREQ_CHANNEL_0                         (0u)
#define ADC_FREQ_CHANNEL_1                         (1u)
#define ADC_FREQ_CHANNEL_2                         (2u)

/* Bit-mask which says that scanning is not complete */
#define ADC_SW_STS_BUSY                            (ADC_STATUS_CSD0_MASK)
#define ADC_NOT_BUSY                               (0u)

#define ADC_WDGT_SW_STS_BUSY                       (ADC_STATUS_WDGT0_BUSY_MASK)

#define ADC_DELAY_EXTRACYCLES_NUM                  (9u)
#define ADC_GLITCH_ELIMINATION_CYCLES_CALC         (ADC_CSD_PRESCAN_SETTLING_TIME * CYDEV_BCLK__SYSCLK__MHZ)
#define ADC_CMOD_DISCHARGE_TIME                    (2u)
#define ADC_CMOD_DISCHARGE_CYCLES_CALC             (ADC_CMOD_DISCHARGE_TIME * CYDEV_BCLK__SYSCLK__MHZ)

#if(ADC_GLITCH_ELIMINATION_CYCLES_CALC >= ADC_DELAY_EXTRACYCLES_NUM)
    #define ADC_GLITCH_ELIMINATION_CYCLES          (ADC_GLITCH_ELIMINATION_CYCLES_CALC -\
                                                                ADC_DELAY_EXTRACYCLES_NUM)
#else
    #define ADC_GLITCH_ELIMINATION_CYCLES          (ADC_GLITCH_ELIMINATION_CYCLES_CALC)
#endif /* (ADC_GLITCH_ELIMINATION_CYCLES_CALC >= ADC_DELAY_EXTRACYCLES_NUM) */

#if(ADC_CMOD_DISCHARGE_CYCLES_CALC >= ADC_DELAY_EXTRACYCLES_NUM)
    #define ADC_CMOD_DISCHARGE_CYCLES              (ADC_CMOD_DISCHARGE_CYCLES_CALC -\
                                                                ADC_DELAY_EXTRACYCLES_NUM)
#else
    #define ADC_CMOD_DISCHARGE_CYCLES              (ADC_CMOD_DISCHARGE_CYCLES_CALC)
#endif /* (ADC_CMOD_DISCHARGE_CYCLES_CALC >= ADC_DELAY_EXTRACYCLES_NUM) */

#define ADC_PRECHARGE_IDAC_MOD_VAL                 (0xF0u)
#define ADC_CSD_IDAC_PRECHARGE_CONFIG              (ADC_IDAC_MOD_MODE_VARIABLE |\
                                                                 ADC_IDAC_MOD_RANGE_MASK |\
                                                                 ADC_IDAC_FEEDBACK_MODE_MASK |\
                                                                 ADC_PRECHARGE_IDAC_MOD_VAL)

#define ADC_CNT_RESOLUTION_12_BITS                 (0x0FFF0000Lu)
#define ADC_ONE_CYCLE                              (0x00010000Lu)
#define ADC_RESOLUTION_16_BITS                     (0xFFFF0000Lu)
#define ADC_DISCONNECT_IO_FLAG                     (1u)

#define ADC_PERCENTAGE_100                         (0x00000064Lu)


#endif /* End CY_SENSE_ADC_SENSING_H */


/* [] END OF FILE */
